#ifndef JVCLIENT_H
#define JVCLIENT_H
#include "JVNSDKDef.h"
#ifndef WIN32//‚àë¬´windows≈ì¬µ√ï‚â•

#ifdef MOBILE_CLIENT
extern "C" {
#else
	#ifdef __cplusplus
		#define JVCLIENT_API extern "C"
	#else
		#define JVCLIENT_API
	#endif
#endif
#else
#define JVCLIENT_API extern "C" __declspec(dllexport)
#endif
/////////////////////////////////////////////////////////////////////////////////////////////////////////
//                                                                                                     //
//                                      ‚àë√∑√∏√ø‚àÇ√ÄŒ©‚Äù√∏‚ÅÑ                                                     //
//                                                                                                     //
/////////////////////////////////////////////////////////////////////////////////////////////////////////
/***************************************Œ©‚Äù√∏‚ÅÑ¬´√Ç¬µ‚Ä¢********************************************************
JVC_InitSDK -----------------01 ‚â•ƒ±¬†¬∫¬™√òSDK‚óä¬†‚Äò¬•
JVC_ReleaseSDK --------------02 ¬†√ï‚àë‚âàSDK‚óä¬†‚Äò¬•¬£¬®¬±√ø‚Äì√é‚óä√ì‚à´√õ¬±¬™¬µÀú‚Äù‚àö
JVC_RegisterCallBack --------03 ‚Ä¶√ã√∑‚àö‚àë√∑√∏√ø‚àÇ√Ä¬™√ø¬µÀú‚à´√ò¬†Àù
JVC_Connect -----------------04 ¬°¬®Œ©‚Äù∆í‚â•√ï¬Æ¬µ¬ø√ï¬Ø¬¨√Å‚àëÀõ≈í√í
JVC_DisConnect --------------05 ‚àÇ≈ì√∏‚Ñ¢∆í‚â•√ï¬Æ¬µ¬ø‚àëÀõ≈í√í¬°¬®Œ©‚Äù
JVC_SendData ----------------06 ‚àë¬¢√Ä√ï¬†Àù√¶‚Ä∫
JVC_EnableLog ---------------07 ‚Ä¶√ã√∑‚àö‚Äì¬•‚â•ÀÜ¬•√å¬ª‚Äô√∑√¶¬†¬´‚àë√í‚Äù‚Äì‚Äì√ü
JVC_SetLanguage -------------08 ‚Ä¶√ã√∑‚àö¬ª‚Äô√∑√¶/√É¬∑¬†√¶‚Äì‚âà≈ì¬¢‚Äù√î‚Äî‚Äò(‚Äù¬¢≈í∆í/√∑‚Äì≈í∆í)
JVC_TCPConnect --------------09 ‚àëŒ©¬†Œ©¬°¬®Œ©‚Äù∆í‚â•√ï¬Æ¬µ¬ø√ï¬Ø¬¨√Å‚àëÀõ≈í√í
JVC_GetPartnerInfo ----------10 ¬™√í¬ª¬∞¬™√î‚àû√àŒ©‚ÅÑ¬µ‚Äû‚Äì‚âà≈ì¬¢
JVC_RegisterRateCallBack ----11 ‚óä¬¢‚â§¬∑¬™‚à´‚â•√ÇŒ©¬Ø‚àÇ¬ª¬™√ø¬µÀú‚à´√ò¬†Àù
JVC_StartLANSerchServer -----12 √∏‚Ñ¢‚àÜ√ô‚àëÀõ≈í√í√∏‚Ä¶‚Äú‚Äò√Ä‚Äî√ÄÀú√¶√∑‚Äù√ö√ï¬Ø√∑‚Äì≈í¬®‚Ä¶√ã¬±‚àè
JVC_StopLANSerchServer ------13 √ï¬£√∑œÄ√Ä‚Äî√ÄÀú‚àëÀõ≈í√í
JVC_LANSerchDevice ----------14 √Ä‚Äî√ÄÀú√¶√∑‚Äù√ö√ï¬Ø√∑‚Äì≈í¬®‚Ä¶√ã¬±‚àè
JVC_SetLocalFilePath --------15 ‚óä‚Äò‚àÇ¬Æ‚Äú√Ç¬±√¶¬µ√ø≈í∆í¬∫Àõ¬•√ä¬•¬¢¬¨‚àë√¶‚àÇ¬£¬®‚àû¬∏¬ø¬Æ¬ª‚Äô√∑√¶¬£¬®‚Ä¶Àô‚â•‚Ä¶¬µ∆í‚àÜ‚Ä∞√ÄÀöœÄ√ø¬∫¬∏≈í∆í¬∫Àõ¬µ¬ª
JVC_SetDomainName -----------16 ‚Ä¶√ã√∑‚àö‚Äì¬¨¬µ∆í‚Äù√ö‚àöÀö¬£¬®≈ì¬µ√ï‚â•Œ©¬¥¬•‚Äù‚àÜ‚Ä∞¬™√í¬ª¬∞‚àëÀõ≈í√í‚àÜÀú¬°‚Äì¬±√å
JVC_WANGetChannelCount ------17 √ï¬ÆœÄÀù√ï‚Äö√ï¬Ø¬™√í¬ª¬∞∆í‚â•‚àèÀÜ‚Äò‚àÜ¬†‚Äù√ï¬Æ‚à´‚âà¬¨√é√ÄÀò√¶Ô¨Ç‚Äù‚Äì¬µ∆í√ï¬Æ¬µ¬ø‚óä‚Äπ¬†Àù
JVC_StartBroadcastServer ----18 √∏‚Ñ¢‚àÜ√ô‚óä‚Äò‚àÇ¬Æ‚Äú√ÇœÄ‚Äû‚â§‚Ä¢‚àëÀõ≈í√í
JVC_StopBroadcastServer -----19 √ï¬£√∑œÄ‚óä‚Äò‚àÇ¬Æ‚Äú√ÇœÄ‚Äû‚â§‚Ä¢‚àëÀõ≈í√í
JVC_BroadcastOnce -----------20 ‚àë¬¢√Ä√ïœÄ‚Äû‚â§‚Ä¢≈ìÀö≈ì¬¢
JVC_ClearBuffer -------------21 ¬´√Ç¬ø√å¬±√¶¬µ√ø¬™‚à´¬•√ä

JVC_EnableHelp---------------22 ‚àÜ√ô‚Äù‚àö/√ï¬£‚Äù‚àö√∏√è√Ä≈∏¬°¬•Œ©‚Äù‚àëÀõ≈í√í(‚Äò‚àÜ¬†‚Äù√ï¬Æ‚Äì¬∞√∑Àô¬†√∑¬†œÄ‚Äù‚àö)
JVC_SetHelpYSTNO-------------23 ‚Ä¶√ã√∑‚àö‚àÇ‚Äò∆í‚â•‚Äì¬©‚Äò‚àÜ¬†‚Äù√ï¬Æ‚à´‚âà¬¨√é¬µ∆í‚àè¬Æ√∑Àô√∑√ü‚â•√∑
JVC_GetHelpYSTNO-------------24 ¬™√í¬ª¬∞‚àÇ‚Äò∆í‚â•‚Äì¬©‚Äò‚àÜ¬†‚Äù√ï¬Æ‚à´‚âà¬¨√é¬µ∆í‚àè¬Æ√∑Àô√∑√ü‚â•√∑
JVC_EnableLANTool------------25 √∏‚Ñ¢‚àÜ√ô‚àëÀõ≈í√í√∏‚Ä¶‚Äú‚Äò√Ä‚Äî√ÄÀú‚âà‚Ä∞√∑‚àö√¶√∑‚Äù√ö√ï¬Ø√∑‚Äì¬µ∆í‚Ä¶√ã¬±‚àè
JVC_LANToolDevice------------26 √Ä‚Äî√ÄÀú√¶√∑‚Äù√ö√ï¬Ø√∑‚Äì¬µ∆í√∏‚Ä¶‚âà‚Ä∞√∑‚àö‚Ä¶√ã¬±‚àè
JVC_SendCMD------------------27 ≈ì√ö√∑Àú√∏√ø‚àÇ√Ä‚àë¬¢√Ä√ï‚Äú¬™‚Äì¬©√É√ø¬†‚Äö‚àö¬∏¬°√ì
JVC_AddFSIpSection-----------28 ‚ÄòÀÜ¬∫‚Äù‚Äù‚âà≈ì¬ª‚àë¬¢√Ä√ïœÄ‚Äû‚â§‚Ä¢¬µ∆íIP‚óä√à
JVC_MOLANSerchDevice --------29 ¬†√∑¬™Àô√Ä‚Äî√ÄÀú√¶√∑‚Äù√ö√ï¬Ø√∑‚Äì≈í¬®‚Ä¶√ã¬±‚àè
JVC_RegisterCommonCallBack---30 ¬†√∑¬™Àô‚óä¬Æ‚Äù‚àö¬™√ø¬µÀú‚óä¬¢‚â§¬∑
*******************************************************************************************************/


/****************************************************************************
*‚àöÀö‚â•‚àÜ  : JVC_InitSDK
*œÄ¬∂∆í‚Äπ  : ‚â•ƒ±¬†¬∫¬™√òSDK‚óä¬†‚Äò¬•¬£¬®¬±√ø‚Äì√é¬±¬™¬µ‚ÅÑ‚Äú¬™‚àèÀÜ¬µÀú‚Äù‚àö
*‚â§≈í¬†Àù  : [IN] nLocalStartPort ¬±√¶¬µ√ø¬°¬®Œ©‚Äù¬†œÄ‚Äù‚àö¬µ∆í‚àÜÔ£ø¬†¬∫‚àÇ√Ä√∏‚ÅÑ <0¬†¬±∆í¬®¬ª≈ì9200
*‚àë¬µ¬™√ø√∑¬µ: TRUE     ‚â•‚Ä¶œÄ¬∂
         FALSE    ¬†√ü‚àû‚Äπ
*‚àÜ‚Ä∞√ÄÀö  : ≈íÔ¨Å
*****************************************************************************/
#ifndef WIN32
#ifdef MOBILE_CLIENT 
	JVCLIENT_API int JVC_InitSDK(int nLocStartPort,char* pfWriteReadData);
#else
	JVCLIENT_API int JVC_InitSDK(int nLocStartPort);
#endif
#else
	JVCLIENT_API bool __stdcall	JVC_InitSDK(int nLocStartPort);
#endif

/****************************************************************************
*‚àöÀö‚â•‚àÜ  : JVC_ReleaseSDK
*œÄ¬∂∆í‚Äπ  : ¬†√ï‚àë‚âàSDK‚óä¬†‚Äò¬•¬£¬®¬±√ø‚Äì√é‚óä√ì‚à´√õ¬±¬™¬µÀú‚Äù‚àö
*‚â§≈í¬†Àù  : ≈íÔ¨Å
*‚àë¬µ¬™√ø√∑¬µ: ≈íÔ¨Å
*‚àÜ‚Ä∞√ÄÀö  : ≈íÔ¨Å
*****************************************************************************/
#ifndef WIN32
	JVCLIENT_API void JVC_ReleaseSDK();
#else
	JVCLIENT_API void __stdcall	JVC_ReleaseSDK();
#endif

/****************************************************************************
*‚àöÀö‚â•‚àÜ  : JVC_RegisterSCallBack
*œÄ¬∂∆í‚Äπ  : ‚Ä¶√ã√∑‚àö‚àë√∑√∏√ø‚àÇ√Ä¬™√ø¬µÀú‚à´√ò¬†Àù
*‚â§≈í¬†Àù  : [IN] ConnectCallBack   ‚Äù√é√∑Àú√∏√ø¬°¬®Œ©‚Äù‚óä¬•√∏ÀÜ¬™√ø¬µÀú‚à´√ò¬†Àù
*‚àë¬µ¬™√ø√∑¬µ: ≈íÔ¨Å
*‚àÜ‚Ä∞√ÄÀö  : ‚àë√∑√∏√ø‚àÇ√Ä¬™√ø¬µÀú‚à´√ò¬†Àù‚àû¬∏¬ø¬Æ¬£‚à´
             ‚Äù√é√∑Àú√∏√ø‚àÇ√Ä√ï¬Æ‚Äì‚âà‚óä¬•√É¬®‚à´√ò¬†Àù¬£¬™      (¬°¬®Œ©‚Äù‚óä¬•√É¬®)
			 ¬†¬µ¬†¬±¬∫‚Ä°√∏√ø¬•¬∂¬ø√å                (¬†‚Äô¬µŒ©¬†¬µ¬†¬±¬∫‚Ä°√∏√ø¬†Àù√¶‚Ä∫)
		     ¬¨¬∫≈ì√í¬∫√è√ÄÀúŒ©¬∑œÄÀö¬•¬∂¬ø√å‚à´√ò¬†Àù¬£¬™      (¬†‚Äô¬µŒ©¬¨¬∫≈ì√í¬∫√è√ÄÀúŒ©¬∑œÄÀö)
			 ‚Äù√î‚Äú√ô¬°∆í√É√è/≈í∆í¬±√¶¬°∆í√É√è‚à´√ò¬†Àù       (‚Äò‚àÇ‚â•√É‚Äù√î‚Äú√ô‚à´√ï≈í∆í¬±√¶¬°∆í√É√è)
			 ‚Äò‚àÇ‚â•√É≈ì¬¨‚Äò√ø‚à´√ò¬†Àù¬£¬™              (‚Äò‚àÇ‚â•√É≈ì¬¨‚Äò√ø¬†Àù√¶‚Ä∫)
			 ‚Äò‚àÇ‚â•√É¬™√ø‚àë‚âà‚à´√ò¬†Àù¬£¬™              (‚Äò‚àÇ‚â•√É¬™√ø‚àë‚âà¬†Àù√¶‚Ä∫)
*****************************************************************************/
#ifndef WIN32
	JVCLIENT_API void  JVC_RegisterCallBack(FUNC_CCONNECT_CALLBACK ConnectCallBack,
													FUNC_CNORMALDATA_CALLBACK NormalData,
													FUNC_CCHECKRESULT_CALLBACK CheckResult,
													FUNC_CCHATDATA_CALLBACK ChatData,
													FUNC_CTEXTDATA_CALLBACK TextData,
													FUNC_CDOWNLOAD_CALLBACK DownLoad,
													FUNC_CPLAYDATA_CALLBACK PlayData);
#else
	JVCLIENT_API void __stdcall	JVC_RegisterCallBack(FUNC_CCONNECT_CALLBACK ConnectCallBack,
													FUNC_CNORMALDATA_CALLBACK NormalData,
													FUNC_CCHECKRESULT_CALLBACK CheckResult,
													FUNC_CCHATDATA_CALLBACK ChatData,
													FUNC_CTEXTDATA_CALLBACK TextData,
													FUNC_CDOWNLOAD_CALLBACK DownLoad,
													FUNC_CPLAYDATA_CALLBACK PlayData);
#endif

    
    /**
     nEnableOem: 1:enable; 0:unenable  default:0
     
     return 1 ok -1 uninitsdk
     **/
    JVCLIENT_API int JVC_EnableOEM(int nEnableOem);
    
/****************************************************************************
*‚àöÀö‚â•‚àÜ  : JVC_Connect
*œÄ¬∂∆í‚Äπ  : ¬°¬®Œ©‚Äù∆í‚â•√ï¬Æ¬µ¬ø√ï¬Ø¬¨√Å‚àëÀõ≈í√í
*‚â§≈í¬†Àù  : [IN] nLocalChannel ¬±√¶¬µ√ø√ï¬Æ¬µ¬ø‚à´‚âà >=1
         [IN] nChannel      ‚àëÀõ≈í√í√ï¬Æ¬µ¬ø‚à´‚âà >=1
		 [IN] pchServerIP   ¬µ¬±nYSTNO<0¬†¬±¬£¬®‚àè‚àö‚â§≈í¬†Àù√∑‚àè√ï¬Æ¬µ¬ø‚àëÀõ≈í√íIP¬£¬™¬µ¬±nYSTNO>=0¬†¬±≈íÔ¨Å‚Äì√ü.
		 [IN] nServerPort   ¬µ¬±nYSTNO<0¬†¬±¬£¬®‚àè‚àö‚â§≈í¬†Àù√∑‚àè√ï¬Æ¬µ¬ø‚àëÀõ≈í√íport¬£¬™¬µ¬±nYSTNO>=0¬†¬±≈íÔ¨Å‚Äì√ü.
		 [IN] pchPassName   ‚Äù‚àö¬™√ü‚àöÀö
		 [IN] pchPassWord   ‚àö‚Äπ¬¨√é
		 [IN] nYSTNO        ‚Äò‚àÜ¬†‚Äù√ï¬Æ‚à´‚âà¬¨√é¬£¬®‚â§¬™¬†œÄ‚Äù‚àö¬†¬±√∑‚àö-1
		 [IN] chGroup       ¬±‚Ä°‚óä√à‚à´‚âà¬£¬®‚Äì≈í¬ª√Å"A" "AAAA" ¬†œÄ‚Äù‚àö‚Äò‚àÜ¬†‚Äù√ï¬Æ‚à´‚âà¬¨√é¬†¬±‚Äù‚Äì‚Äì√ü
		 [IN] bLocalTry     ¬†¬´‚àë√íŒ©¬Ø‚Äì‚Äì∆í‚ÅÑ√ï¬Ø√ÉŒ©‚â§‚Äö
		 [IN] nTURNType     ‚óä‚Ñ¢‚àë¬¢œÄ¬∂∆í‚Äπ¬ø‚Ä°‚Äì√ï(Œ©Àö‚Äù‚àö‚óä‚Ñ¢‚àë¬¢\‚àÜ√ô‚Äù‚àö‚óä‚Ñ¢‚àë¬¢\Œ©ÀÜ‚Äù‚àö‚óä‚Ñ¢‚àë¬¢)
*‚àë¬µ¬™√ø√∑¬µ: ≈íÔ¨Å
*‚àÜ‚Ä∞√ÄÀö  : nLocalChannel <= -2 ¬´‚Äú nChannel = -1 √∏‚Ä¶¬°¬®Œ©‚Äù‚àëÀõ≈í√í‚àÇ√Ä¬µ∆í√É√ø¬†‚Äö√ï¬Æ¬µ¬ø¬£¬®
         √∏‚Ä¶¬±‚Äπ√∏‚Ñ¢¬†‚Äù‚àÜ¬µ¬†Àù√¶‚Ä∫¬£¬®‚Äù‚àö‚Äù‚ÅÑ¬†‚Äô‚àë¬¢‚àÜ‚Äô√ï¬Æ¬†Àù√¶‚Ä∫
*****************************************************************************/
#ifndef WIN32
	#ifdef MOBILE_CLIENT
	JVCLIENT_API void JVC_Connect(int nLocalChannel,int nChannel,
		                          char *pchServerIP,int nServerPort,
		                          char *pchPassName,char *pchPassWord,
		                          int nYSTNO,char chGroup[4],
		                          int bLocalTry,
		                          int nTURNType,
		                          int bCache,
								  int nConnectType,BOOL isBeRequestVedio,int nVIP,int nOnlyTCP);
    #else
	JVCLIENT_API void JVC_Connect(int nLocalChannel,int nChannel,
		                          char *pchServerIP,int nServerPort,
		                          char *pchPassName,char *pchPassWord,
		                          int nYSTNO,char chGroup[4],
		                          int bLocalTry,
		                          int nTURNType,
		                          int bCache);
    #endif
#else
	JVCLIENT_API void __stdcall	JVC_Connect(int nLocalChannel,int nChannel,
											char *pchServerIP,int nServerPort,
											char *pchPassName,char *pchPassWord,
											int nYSTNO,char chGroup[4],
											BOOL bLocalTry,
											int nTURNType,
											BOOL bCache);
#endif

/****************************************************************************
*‚àöÀö‚â•‚àÜ  : JVC_DisConnect
*œÄ¬∂∆í‚Äπ  : ‚àÇ≈ì√∏‚Ñ¢∆í‚â•√ï¬Æ¬µ¬ø‚àëÀõ≈í√í¬°¬®Œ©‚Äù
*‚â§≈í¬†Àù  : [IN] nLocalChannel ‚àëÀõ≈í√í√ï¬Æ¬µ¬ø‚à´‚âà >=1
*‚àë¬µ¬™√ø√∑¬µ: ≈íÔ¨Å
*‚àÜ‚Ä∞√ÄÀö  :
*****************************************************************************/
#ifndef WIN32
	JVCLIENT_API void JVC_DisConnect(int nLocalChannel);
#else
	JVCLIENT_API void __stdcall	JVC_DisConnect(int nLocalChannel);
#endif

/****************************************************************************
*‚àöÀö‚â•‚àÜ  : JVC_SendData
*œÄ¬∂∆í‚Äπ  : ‚àë¬¢√Ä√ï¬†Àù√¶‚Ä∫
*‚â§≈í¬†Àù  : [IN] nLocalChannel   ¬±√¶¬µ√ø√ï¬Æ¬µ¬ø‚à´‚âà >=1
         [IN] uchType          ¬†Àù√¶‚Ä∫¬ø‚Ä°‚Äì√ï¬£‚à´‚àèÀú√∑√∑¬´√é¬´√õ¬£¬™‚àèÀú√∑√∑√∏√ø√∑‚àÜ¬£¬™‚àèÀú√∑√∑‚Äù¬∂¬•Ô£ø
         [IN] pBuffer         ¬•Àù‚àë¬¢¬†Àù√¶‚Ä∫∆í‚ÅÑ¬ª‚Ä∫
		 [IN] nSize           ¬•Àù‚àë¬¢¬†Àù√¶‚Ä∫‚â•¬ß‚àÇ¬ª
*‚àë¬µ¬™√ø√∑¬µ: ≈íÔ¨Å
*‚àÜ‚Ä∞√ÄÀö  : ≈ì√ö√ï¬Æ¬µ¬ø¬°¬®Œ©‚Äù¬µ∆í√∑Àú√∏√ø‚àë¬¢√Ä√ï¬†Àù√¶‚Ä∫
*****************************************************************************/
#ifndef WIN32
	JVCLIENT_API BOOL JVC_SendData(int nLocalChannel, unsigned char uchType, unsigned char *pBuffer,int nSize);
#else
	JVCLIENT_API void __stdcall	JVC_SendData(int nLocalChannel, unsigned char uchType, unsigned char  *pBuffer,int nSize);
#endif

/****************************************************************************
*‚àöÀö‚â•‚àÜ  : JVN_EnableLog
*œÄ¬∂∆í‚Äπ  : ‚Ä¶√ã√∑‚àö‚Äì¬•‚â•ÀÜ¬•√å¬ª‚Äô√∑√¶¬†¬´‚àë√í‚Äù‚Äì‚Äì√ü
*‚â§≈í¬†Àù  : [IN] bEnable  TRUE:‚â•ÀÜ¬•√å¬†¬±‚Äì¬•¬ª‚Äô√∑√¶¬£¬™FALSE:‚â§¬™‚Äì¬•¬ª≈í‚à´≈í¬ª‚Äô√∑√¶
*‚àë¬µ¬™√ø√∑¬µ: ≈íÔ¨Å
*‚àÜ‚Ä∞√ÄÀö  : ≈íÔ¨Å
*****************************************************************************/
#ifndef WIN32
	JVCLIENT_API void JVC_EnableLog(int bEnable);
#else
	JVCLIENT_API void __stdcall	JVC_EnableLog(bool bEnable);
#endif

/****************************************************************************
*‚àöÀö‚â•‚àÜ  : JVC_SetLanguage
*œÄ¬∂∆í‚Äπ  : ‚Ä¶√ã√∑‚àö¬ª‚Äô√∑√¶/√É¬∑¬†√¶‚Äì‚âà≈ì¬¢‚Äù√î‚Äî‚Äò(‚Äù¬¢≈í∆í/√∑‚Äì≈í∆í)
*‚â§≈í¬†Àù  : [IN] nLgType  JVN_LANGUAGE_ENGLISH/JVN_LANGUAGE_CHINESE
*‚àë¬µ¬™√ø√∑¬µ: ≈íÔ¨Å
*‚àÜ‚Ä∞√ÄÀö  : ≈íÔ¨Å
*****************************************************************************/
#ifndef WIN32
	JVCLIENT_API void JVC_SetLanguage(int nLgType);
#else
	JVCLIENT_API void __stdcall	JVC_SetLanguage(int nLgType);
#endif

/****************************************************************************
*‚àöÀö‚â•‚àÜ  : JVC_TCPConnect
*œÄ¬∂∆í‚Äπ  : TCP‚àëŒ©¬†Œ©¬°¬®Œ©‚Äù∆í‚â•√ï¬Æ¬µ¬ø√ï¬Ø¬¨√Å‚àëÀõ≈í√í
*‚â§≈í¬†Àù  : [IN] nLocalChannel ¬±√¶¬µ√ø√ï¬Æ¬µ¬ø‚à´‚âà >=1
         [IN] nChannel      ‚àëÀõ≈í√í√ï¬Æ¬µ¬ø‚à´‚âà >=1
		 [IN] pchServerIP   ¬µ¬±nYSTNO<0¬†¬±¬£¬®‚àè‚àö‚â§≈í¬†Àù√∑‚àè√ï¬Æ¬µ¬ø‚àëÀõ≈í√íIP¬£¬™¬µ¬±nYSTNO>=0¬†¬±≈íÔ¨Å‚Äì√ü.
		 [IN] nServerPort   ¬µ¬±nYSTNO<0¬†¬±¬£¬®‚àè‚àö‚â§≈í¬†Àù√∑‚àè√ï¬Æ¬µ¬ø‚àëÀõ≈í√íport¬£¬™¬µ¬±nYSTNO>=0¬†¬±≈íÔ¨Å‚Äì√ü.
		 [IN] pchPassName   ‚Äù‚àö¬™√ü‚àöÀö
		 [IN] pchPassWord   ‚àö‚Äπ¬¨√é
		 [IN] nYSTNO        ‚Äò‚àÜ¬†‚Äù√ï¬Æ‚à´‚âà¬¨√é¬£¬®‚â§¬™¬†œÄ‚Äù‚àö¬†¬±√∑‚àö-1
		 [IN] chGroup       ¬±‚Ä°‚óä√à‚à´‚âà¬£¬®‚Äì≈í¬ª√Å"A" "AAAA" ¬†œÄ‚Äù‚àö‚Äò‚àÜ¬†‚Äù√ï¬Æ‚à´‚âà¬¨√é¬†¬±‚Äù‚Äì‚Äì√ü
		 [IN] bLocalTry     ¬†¬´‚àë√íŒ©¬Ø‚Äì‚Äì∆í‚ÅÑ√ï¬Ø√ÉŒ©‚â§‚Äö
		 [IN] nConnectType  ¬°¬®Œ©‚Äù‚àëŒ©¬†Œ©¬£‚à´TYPE_PC_TCP/TYPE_MO_TCP
		 [IN] nTURNType     ‚óä‚Ñ¢‚àë¬¢œÄ¬∂∆í‚Äπ¬ø‚Ä°‚Äì√ï(Œ©Àö‚Äù‚àö‚óä‚Ñ¢‚àë¬¢\‚àÜ√ô‚Äù‚àö‚óä‚Ñ¢‚àë¬¢\Œ©ÀÜ‚Äù‚àö‚óä‚Ñ¢‚àë¬¢)
*‚àë¬µ¬™√ø√∑¬µ: ≈íÔ¨Å
*‚àÜ‚Ä∞√ÄÀö  : ≈íÔ¨Å
*****************************************************************************/
#ifndef WIN32
	JVCLIENT_API void JVC_TCPConnect(int nLocalChannel,int nChannel,
									char *pchServerIP,int nServerPort,
									char *pchPassName,char *pchPassWord,
									int nYSTNO,char chGroup[4],
									int bLocalTry,
									int nConnectType,
									int nTURNType);
#else
	JVCLIENT_API void __stdcall	JVC_TCPConnect(int nLocalChannel,int nChannel,
												char *pchServerIP,int nServerPort,
												char *pchPassName,char *pchPassWord,
												int nYSTNO,char chGroup[4],
												BOOL bLocalTry,
												int nConnectType,
												int nTURNType);
#endif


/****************************************************************************
*‚àöÀö‚â•‚àÜ  : JVC_GetPartnerInfo
*œÄ¬∂∆í‚Äπ  : ¬™√í¬ª¬∞¬™√î‚àû√àŒ©‚ÅÑ¬µ‚Äû‚Äì‚âà≈ì¬¢
*‚â§≈í¬†Àù  : [IN] nLocalChannel   ¬±√¶¬µ√ø√ï¬Æ¬µ¬ø‚à´‚âà >=1
         [OUT] pMsg   ‚Äì‚âà≈ì¬¢∆í‚ÅÑ¬ª‚Ä∫
		              (¬†¬´‚àë√í‚àÇ‚Ä°‚â§‚Ä¢(1)+‚Äò‚ÅÑ≈ìÔ¨Ç‚óä‚Äπ‚àèÀÜ¬†Àù(4)+‚Äú‚Äî¬°¬®Œ©‚Äù‚óä‚Äπ¬†Àù(4)+[IP(16) + port(4)+¬°¬®Œ©‚Äù‚óä¬•√É¬®(1)+≈ì¬¨‚Äò√ø√Ä≈∏‚àÇ¬ª(4)+≈ì¬¨‚Äò√ø‚óä‚Äπ¬°√∏(4)+‚Ä¶≈ì¬•¬¥‚óä‚Äπ¬°√∏(4)]
					                +[...]...)
		 [OUT] nSize  ‚Äì‚âà≈ì¬¢‚óä‚Äπ‚â•¬ß‚àÇ¬ª
*‚àë¬µ¬™√ø√∑¬µ: ≈íÔ¨Å
*‚àÜ‚Ä∞√ÄÀö  : ¬µÀú‚Äù‚àö‚àÜ¬µ¬¨¬†‚Äî≈ìŒ©Àö√É¬¥‚àèÔ¨Ç¬£¬®‚àë√í‚Äò√ö¬™¬∑‚Äù‚àû≈ì√è¬†‚Äù‚àÜ¬µ¬•¬∂¬ø√å√Ä≈∏‚àÇ¬ª¬£¬™
         ‚àÜ¬µ‚àë¬±‚â•√É‚àÇ¬ª‚àÇ¬ª‚â§¬™∆í‚Äπ¬µ√ï‚Äù‚ÅÑ1‚àö√é¬£¬®‚óä√ì‚à´‚àö‚Äò‚ÅÑ2‚àö√é‚Äú‚Äò‚Ä¶≈ì¬™√ö‚àè¬∏‚â•¬ß¬†¬±¬∫‚Ä∞¬£¬®¬†¬±¬∫‚Ä∞‚ÄòŒ©‚â•¬ß‚Äù‚àû≈ì√è‚ÄòŒ©‚Äì¬∞¬∞¬£
*****************************************************************************/
#ifndef WIN32
	JVCLIENT_API void JVC_GetPartnerInfo(int nLocalChannel, char *pMsg, int *nSize);
#else
	JVCLIENT_API void __stdcall	JVC_GetPartnerInfo(int nLocalChannel, char *pMsg, int &nSize);
#endif

#ifndef WIN32
	JVCLIENT_API void JVC_RegisterRateCallBack(FUNC_CBUFRATE_CALLBACK BufRate);
#else
	JVCLIENT_API void __stdcall	JVC_RegisterRateCallBack(FUNC_CBUFRATE_CALLBACK BufRate);
#endif

/****************************************************************************
*‚àöÀö‚â•‚àÜ  : JVC_StartLANSerchServer
*œÄ¬∂∆í‚Äπ  : √∏‚Ñ¢‚àÜ√ô‚àëÀõ≈í√í√∏‚Ä¶‚Äú‚Äò√Ä‚Äî√ÄÀú√¶√∑‚Äù√ö√ï¬Ø√∑‚Äì≈í¬®‚Ä¶√ã¬±‚àè
*‚â§≈í¬†Àù  : [IN] nLPort      ¬±√¶¬µ√ø‚àëÀõ≈í√í‚àÇ√Ä√∏‚ÅÑ¬£¬®<0¬†¬±≈í‚Ñ¢∆í¬®¬ª≈ì9400
         [IN] nServerPort ‚Ä¶√ã¬±‚àè‚àÇ√Ä‚àëÀõ≈í√í‚àÇ√Ä√∏‚ÅÑ¬£¬®<=0¬†¬±≈í‚Ñ¢∆í¬®¬ª≈ì9103,Œ©¬Æ‚Äú√à√ï‚â•‚Äú¬™‚Äù‚àö∆í¬®¬ª≈ì√∑¬µ‚Äù√é‚àëÀõ≈í√í‚àÇ√Ä‚àÜ‚Ä¢‚âà‚Ä∞
		 [IN] LANSData    √Ä‚Äî√ÄÀúŒ©¬∑œÄÀö¬™√ø¬µÀú‚à´√ò¬†Àù
*‚àë¬µ¬™√ø√∑¬µ: TRUE/FALSE
*‚àÜ‚Ä∞√ÄÀö  : √∏‚Ñ¢‚àÜ√ô¬°√Ä√Ä‚Äî√ÄÀú‚àëÀõ≈í√í‚â§‚âà√∏‚Ä¶‚Äú‚ÄòŒ©‚Äù¬†‚Äô√Ä‚Äî√ÄÀúŒ©¬∑œÄÀö¬£¬®√Ä‚Äî√ÄÀú√Éƒ±¬∫Àõ√ï¬ÆœÄÀùJVC_LANSerchDeviceŒ©‚Äù√∏‚ÅÑ√∑‚àè‚àÇ¬Æ
*****************************************************************************/
#ifndef WIN32
	JVCLIENT_API int JVC_StartLANSerchServer(int nLPort, int nServerPort, FUNC_CLANSDATA_CALLBACK LANSData);
#else
	JVCLIENT_API bool __stdcall	JVC_StartLANSerchServer(int nLPort, int nServerPort, FUNC_CLANSDATA_CALLBACK LANSData);
#endif

/****************************************************************************
*‚àöÀö‚â•‚àÜ  : JVC_StopLANSerchServer
*œÄ¬∂∆í‚Äπ  : √ï¬£√∑œÄ√Ä‚Äî√ÄÀú‚àëÀõ≈í√í
*‚â§≈í¬†Àù  : ≈íÔ¨Å
*‚àë¬µ¬™√ø√∑¬µ: ≈íÔ¨Å
*‚àÜ‚Ä∞√ÄÀö  : ≈íÔ¨Å
*****************************************************************************/
#ifndef WIN32
	JVCLIENT_API void JVC_StopLANSerchServer();
#else
	JVCLIENT_API void __stdcall	JVC_StopLANSerchServer();
#endif


#ifndef WIN32
    JVCLIENT_API int JVC_MOStopLANSerchServer();
#else
    JVCLIENT_API int __stdcall	JVC_MOStopLANSerchServer();
#endif
    
/****************************************************************************
*‚àöÀö‚â•‚àÜ  : JVC_LANSerchDevice
*œÄ¬∂∆í‚Äπ  : √Ä‚Äî√ÄÀú√¶√∑‚Äù√ö√ï¬Ø√∑‚Äì≈í¬®‚Ä¶√ã¬±‚àè
*‚â§≈í¬†Àù  : [IN] chGroup     ¬±‚Ä°‚óä√à‚à´‚âà¬£¬®¬±‚Ä°‚óä√à‚à´‚âà+nYSTNO√∏‚Ä¶¬ª‚àë‚àÇ¬Æ≈í¬Æ‚Äú¬™‚Ä¶√ã¬±‚àè
         [IN] nYSTNO      √Ä‚Äî√ÄÀú√¶Ô¨Ç‚Äù‚Äì∆í‚â•‚Äò‚àÜ¬†‚Äù√ï¬Æ‚à´‚âà¬¨√é¬µ∆í‚Ä¶√ã¬±‚àè¬£¬®>0‚Äù‚Äì‚Äì√ü
         [IN] nCardType   √Ä‚Äî√ÄÀú∆í‚â•‚Äì√ï‚à´‚âà¬µ∆í‚Ä¶√ã¬±‚àè¬£¬®>0‚Äù‚Äì‚Äì√ü,¬µ¬±nYSTNO>0¬†¬±‚àè‚àö‚â§≈í¬†Àù≈íÔ¨Å‚Äì√ü
		 [IN] chDeviceName√Ä‚Äî√ÄÀú∆í‚â•‚àèÀÜ¬±Ô£ø‚àöÀö¬µ∆í‚Ä¶√ã¬±‚àè¬£¬®strlen>0‚Äù‚Äì‚Äì√ü¬£¬®¬µ¬±nYSTNO>0¬†¬±≈íÔ¨Å‚Äì√ü
		 [IN] nVariety    √Ä‚Äî√ÄÀú∆í‚â•‚àèÀÜ¬ø‚Ä°¬±Ô£ø¬µ∆í‚Ä¶√ã¬±‚àè¬£¬®1‚àû√Ç√∏¬Æ;2DVR;3IPC;>0‚Äù‚Äì‚Äì√ü,¬µ¬±nYSTNO>0¬†¬±‚àè‚àö‚â§≈í¬†Àù≈íÔ¨Å‚Äì√ü
		 [IN] nTimeOut    ¬±√¶¬µ√ø√Ä‚Äî√ÄÀú‚Äù‚Äì‚Äì√ü¬†¬±¬∫‚Ä∞¬£¬®¬µ‚Ä¢≈í¬™‚à´¬°‚àö√é¬∞¬£‚â•¬®œÄÀù‚àè‚àö¬†¬±¬∫‚Ä∞¬µ∆íŒ©¬∑œÄÀöŒ©¬¥¬±¬™‚Ä¶¬∑‚àÜÀô¬£¬®
		                  ‚â•¬®¬†¬±¬†¬±¬∫‚Ä∞¬µŒ©¬•√î‚à´√õ¬™√ø¬µÀú‚à´√ò¬†Àù√∑‚ÄìŒ©¬¥¬µ‚àö¬µŒ©‚â•¬®¬†¬±√É¬∑¬†√¶‚óäÀú≈í‚Ñ¢√Ä‚Äî√ÄÀúŒ©¬∑¬†¬Ø¬±√ç√∑√¶¬∞¬£
						  ¬ª√ÅœÄÀö‚â§¬™≈ì√é¬†œÄ‚Äù‚àöSDK‚â•¬®¬†¬±¬•¬∂¬ø√å√∏‚Ä¶‚Äú‚Äò√∑‚àö≈í‚Ñ¢0¬£¬®¬•√Ä¬†¬±Œ©¬∑œÄÀö¬´√∏¬ª¬¥‚â§√∏‚àë¬µ¬™√ø‚àè¬Ø¬µÀú‚Äù‚àö‚ÄôÔ¨Ç¬∞¬£

						  √ï¬®√ï¬Ø‚àÇ≈í¬µ∆í‚Ä¶√ã¬±‚àè‚Äú¬™‚àû‚Äû∆í‚Äπ‚Äò‚ÅÑ<500¬µ∆í¬†¬±¬∫‚Ä∞∆í‚ÅÑ√Ä‚Äî√ÄÀú¬µŒ©¬£¬™
						  ‚Ä¶√ã¬±‚àè√Ä‚Äî√ÄÀúŒ©¬Æ‚Äú√à√∑¬°‚Ä¶≈∏‚Ä¶√ã√∑‚àö2000¬£¬®¬ª‚àë¬±¬£√Ä‚Äî√ÄÀú¬µ∆í√ï¬Ø‚àÇ≈í¬ª¬¥‚àö√ä¬£¬™
						  ¬∫¬•‚â§√Ç¬∫¬•‚Äù‚àö√Ä‚Äî√ÄÀú√∏‚Ä¶‚àèÀò√¶‚Ä∫‚Äì√ã‚Äú‚Ñ¢‚â•¬ß¬™√ö‚àÇ√É¬£¬®‚ÄòŒ©‚àÇ√É‚ÄòŒ©√∏‚Ä¶∆í‚Äπ‚Äú‚âà¬¨¬©‚â§¬™√ï¬®√ï¬Ø‚àÇ≈í¬µ∆í‚Ä¶√ã¬±‚àè¬£¬™
		 [IN] unFrequence (¬µ‚Ä¢≈í¬™≈í‚Ñ¢s )√∑¬•‚Äì‚Äìping √ï¬ØœÄ√ø¬µ∆í‚àÜ¬µ¬¨¬†¬£¬®∆í¬®¬ª≈ì¬´√é√É√ì¬ª√é30s√Ä‚Äî√ÄÀú‚Äú¬™¬•≈í¬£¬®¬´‚àÇ¬ª√é¬†Œ©‚Ä¶√ã¬±‚àè√∏‚Ä¶‚àèÀò√¶‚Ä∫‚Äì√ã‚Äú‚Ñ¢‚àè¬∏‚àè∆í>20&&<24*3600‚Äù‚Äì‚Äì√ü.

*‚àë¬µ¬™√ø√∑¬µ: ≈íÔ¨Å
*‚àÜ‚Ä∞√ÄÀö  : ¬µ¬±¬°Œ©‚â§≈í¬†Àù√ï¬®¬†¬±≈í‚Ñ¢0¬†¬±¬£¬®Œ©¬¥√Ä‚Äî√ÄÀú√¶√∑‚Äù√ö√ï¬Ø√∑‚Äì√ÄÀò‚Äù‚Äì√∑‚Äì≈í¬®‚Ä¶√ã¬±‚àè
*****************************************************************************/
#ifndef WIN32
	JVCLIENT_API int  JVC_LANSerchDevice(char chGroup[4], int nYSTNO, int nCardType, int nVariety, char chDeviceName[100], int nTimeOut,unsigned int unFrequence );
#else
	JVCLIENT_API bool __stdcall	JVC_LANSerchDevice(char chGroup[4], int nYSTNO, int nCardType, int nVariety, char chDeviceName[100], int nTimeOut,unsigned int unFrequence );
#endif

/****************************************************************************
*‚àöÀö‚â•‚àÜ  : JVC_SetLocalFilePath
*œÄ¬∂∆í‚Äπ  : ‚óä‚Äò‚àÇ¬Æ‚Äú√Ç¬±√¶¬µ√ø≈í∆í¬∫Àõ¬•√ä¬•¬¢¬¨‚àë√¶‚àÇ¬£¬®‚àû¬∏¬ø¬Æ¬ª‚Äô√∑√¶¬£¬®‚Ä¶Àô‚â•‚Ä¶¬µ∆í‚àÜ‚Ä∞√ÄÀöœÄ√ø¬∫¬∏≈í∆í¬∫Àõ¬µ¬ª
*‚â§≈í¬†Àù  : [IN] chLocalPath  ¬¨‚àë√¶‚àÇ ‚Äì≈í¬ª√Å¬£‚à´"C:\\jovision"  ‚àÜ‚Ä∞√∑‚Äìjovision¬†¬´≈í∆í¬∫Àõ¬∫‚Äì
*‚àë¬µ¬™√ø√∑¬µ: ≈íÔ¨Å
*‚àÜ‚Ä∞√ÄÀö  : ‚â§≈í¬†Àù¬†œÄ‚Äù‚àö∆í‚ÅÑ¬•√ä√∏Œ©¬±¬•¬†¬±¬´√é‚óä¬¢‚Äú‚Äö‚â•ƒ±¬†¬∫¬™√ò¬£¬®‚óä√∑‚àëÀö¬•√Ü‚Äì√ã‚Äú‚Äò'\0'Œ©¬∑¬†¬Ø
*****************************************************************************/
#ifndef WIN32
	JVCLIENT_API int JVC_SetLocalFilePath(char chLocalPath[256]);
#else
	JVCLIENT_API bool __stdcall	JVC_SetLocalFilePath(char chLocalPath[256]);
#endif

/****************************************************************************
*‚àöÀö‚â•‚àÜ  : JVC_SetDomainName
*œÄ¬∂∆í‚Äπ  : ‚Ä¶√ã√∑‚àö‚Äì¬¨¬µ∆í‚Äù√ö‚àöÀö¬£¬®≈ì¬µ√ï‚â•Œ©¬¥¬•‚Äù‚àÜ‚Ä∞¬™√í¬ª¬∞‚àëÀõ≈í√í‚àÜÀú¬°‚Äì¬±√å
*‚â§≈í¬†Àù  : [IN]  pchDomainName     ‚Äù√ö‚àöÀö
[IN]  pchPathName       ‚Äù√ö‚àöÀö≈ì¬¨¬µ∆í≈í∆í¬∫Àõ¬¨‚àë√¶‚àÇ‚àöÀö ‚Äì≈í¬ª√Å¬£‚à´"/down/YSTOEM/yst0.txt"
*‚àë¬µ¬™√ø√∑¬µ: TRUE  ‚â•‚Ä¶œÄ¬∂
FALSE ¬†√ü‚àû‚Äπ
*‚àÜ‚Ä∞√ÄÀö  : ≈ì¬µ√ï‚â•‚â•ƒ±¬†¬∫¬™√ò(JVN_InitSDK)√ï√ç‚à´√õ‚Ä¶√ã√∑‚àö
*****************************************************************************/
#ifndef WIN32
	JVCLIENT_API int JVC_SetDomainName(char *pchDomainName,char *pchPathName);
#else
	JVCLIENT_API bool __stdcall	JVC_SetDomainName(char *pchDomainName,char *pchPathName);
#endif

/****************************************************************************
*‚àöÀö‚â•‚àÜ  : JVC_WANGetChannelCount
*œÄ¬∂∆í‚Äπ  : √ï¬ÆœÄÀù√ï‚Äö√ï¬Ø¬™√í¬ª¬∞∆í‚â•‚àèÀÜ‚Äò‚àÜ¬†‚Äù√ï¬Æ‚à´‚âà¬¨√é√ÄÀò√¶Ô¨Ç‚Äù‚Äì¬µ∆í√ï¬Æ¬µ¬ø‚óä‚Äπ¬†Àù
*‚â§≈í¬†Àù  : [IN]  chGroup   ¬±‚Ä°‚óä√à‚à´‚âà
         [IN]  nYstNO    ‚Äò‚àÜ¬†‚Äù√ï¬Æ‚à´‚âà¬¨√é
		 [IN]  nTimeOutS ¬µ¬ª¬•Àù‚â•¬®¬†¬±¬†¬±¬∫‚Ä∞(‚àö√é)
*‚àë¬µ¬™√ø√∑¬µ: >0  ‚â•‚Ä¶œÄ¬∂,√ï¬Æ¬µ¬ø¬†Àù
         -1 ¬†√ü‚àû‚Äπ¬£¬®‚Äò‚â†‚Äú√ö≈í¬•√∑‚Ñ¢
		 -2 ¬†√ü‚àû‚Äπ¬£¬®‚à´‚âà¬¨√é≈í¬•‚Ä¶≈ì≈ìÔ¨Ç
		 -3 ¬†√ü‚àû‚Äπ¬£¬®√∑Àú√∏√ø‚àû√ä¬±√¶Œ©≈ì√¶‚Ä¶¬£¬®‚â§¬™√∑√ü‚â•√∑‚àè‚àö‚â§√à‚Äî√ò
*‚àÜ‚Ä∞√ÄÀö  : ≈ì¬µ√ï‚â•‚â•ƒ±¬†¬∫¬™√ò(JVN_InitSDK)√ï√ç‚à´√õ √∏‚Ä¶‚àÇ¬ø¬°¬¢¬µÀú‚Äù‚àö
*****************************************************************************/
#ifndef WIN32
	JVCLIENT_API int JVC_WANGetChannelCount(char chGroup[4], int nYSTNO, int nTimeOutS);
#else
	JVCLIENT_API int __stdcall	JVC_WANGetChannelCount(char chGroup[4], int nYSTNO, int nTimeOutS);
#endif

JVCLIENT_API int JVC_WANGetBatchChannelCount(char *pChannelNum, int nYSTNOCnt, int nTimeOutS);
/****************************************************************************
*‚àöÀö‚â•‚àÜ  : JVC_StartBroadcastServer
*œÄ¬∂∆í‚Äπ  : √∏‚Ñ¢‚àÜ√ô‚óä‚Äò‚àÇ¬Æ‚Äú√ÇœÄ‚Äû‚â§‚Ä¢‚àëÀõ≈í√í
*‚â§≈í¬†Àù  : [IN] nLPort      ¬±√¶¬µ√ø‚àëÀõ≈í√í‚àÇ√Ä√∏‚ÅÑ¬£¬®<0¬†¬±≈í‚Ñ¢∆í¬®¬ª≈ì9500
         [IN] nServerPort ‚Ä¶√ã¬±‚àè‚àÇ√Ä‚àëÀõ≈í√í‚àÇ√Ä√∏‚ÅÑ¬£¬®<=0¬†¬±≈í‚Ñ¢∆í¬®¬ª≈ì9106,Œ©¬Æ‚Äú√à√ï‚â•‚Äú¬™‚Äù‚àö∆í¬®¬ª≈ì√∑¬µ‚Äù√é‚àëÀõ≈í√í‚àÇ√Ä‚àÜ‚Ä¢‚âà‚Ä∞
		 [IN] BroadcastData  œÄ‚Äû‚â§‚Ä¢Œ©¬∑œÄÀö¬™√ø¬µÀú‚à´√ò¬†Àù
*‚àë¬µ¬™√ø√∑¬µ: TRUE/FALSE
*‚àÜ‚Ä∞√ÄÀö  : √∏‚Ñ¢‚àÜ√ô¬°√ÄœÄ‚Äû‚â§‚Ä¢‚àëÀõ≈í√í‚â§‚âà√∏‚Ä¶‚Äú‚ÄòŒ©‚Äù¬†‚ÄôœÄ‚Äû‚â§‚Ä¢Œ©¬∑œÄÀö¬£¬®œÄ‚Äû‚â§‚Ä¢∆í‚ÅÑ¬ª‚Ä∫√ï¬ÆœÄÀùJVC_BroadcastOnceŒ©‚Äù√∏‚ÅÑ√∑‚àè‚àÇ¬Æ¬£¬™
         ‚àÇ√Ä√∏‚ÅÑ‚Ä¶√ã√∑‚àö¬´√é‚Äú¬™‚àÇ¬Æ‚óä¬¢‚Äú‚Äö‚à´√ï‚Ä¶√ã¬±‚àè√Ä‚Äî√ÄÀú≈ì‚Ä°œÄ√ø‚àÇ√Ä√∏‚ÅÑ‚óäÀú¬´¬Ø¬±Ô£ø¬£¬®‚àë√í‚Äò√ö¬†Àù√¶‚Ä∫Œ©¬¥‚Äú√è‚â•¬£¬£¬™
*****************************************************************************/
#ifndef WIN32
	JVCLIENT_API int JVC_StartBroadcastServer(int nLPort, int nServerPort, FUNC_CBCDATA_CALLBACK BCData);
#else
	JVCLIENT_API bool __stdcall	JVC_StartBroadcastServer(int nLPort, int nServerPort, FUNC_CBCDATA_CALLBACK BCData);
#endif

/****************************************************************************
*‚àöÀö‚â•‚àÜ  : JVC_StopBroadcastServer
*œÄ¬∂∆í‚Äπ  : √ï¬£√∑œÄ‚óä‚Äò‚àÇ¬Æ‚Äú√ÇœÄ‚Äû‚â§‚Ä¢‚àëÀõ≈í√í
*‚â§≈í¬†Àù  : ≈íÔ¨Å
*‚àë¬µ¬™√ø√∑¬µ: ≈íÔ¨Å
*‚àÜ‚Ä∞√ÄÀö  : ≈íÔ¨Å
*****************************************************************************/
#ifndef WIN32
	JVCLIENT_API void JVC_StopBroadcastServer();
#else
	JVCLIENT_API void __stdcall	JVC_StopBroadcastServer();
#endif

/****************************************************************************
*‚àöÀö‚â•‚àÜ  : JVC_BroadcastOnce
*œÄ¬∂∆í‚Äπ  : ‚àë¬¢√Ä√ïœÄ‚Äû‚â§‚Ä¢≈ìÀö≈ì¬¢
*‚â§≈í¬†Àù  : [IN] nBCID       œÄ‚Äû‚â§‚Ä¢ID,‚Äù‚Ä¶¬µÀú‚Äù‚àö‚ÄôÔ¨Ç‚àÇ¬Æ‚Äú√Ç,‚Äù‚àö‚Äù‚ÅÑ‚Äò‚ÅÑ¬™√ø¬µÀú‚à´√ò¬†Àù√∑‚Äì‚àÜ‚Ä¢‚âà‚Ä∞¬´¬Ø‚àë√∑¬±√¶¬•≈íœÄ‚Äû‚â§‚Ä¢
         [IN] pBuffer     œÄ‚Äû‚â§‚Ä¢√¶¬™‚Äò√ø¬†Àù√¶‚Ä∫,¬†Àù√¶‚Ä∫‚â§¬™‚Äò¬†‚Äì√å‚â•¬®‚â•ÀÜ10k,‚àë√í‚Äò√öŒ©¬¥‚Ä¶¬∑‚àÜÀô‚àÇ‚Ä°‚Äù‚Ä°‚â§√∏‚àë√∑
         [IN] nSize       œÄ‚Äû‚â§‚Ä¢√¶¬™‚Äò√ø¬†Àù√¶‚Ä∫‚â•¬ß‚àÇ¬ª
		 [IN] nTimeOut    ¬±√¶¬•≈íœÄ‚Äû‚â§‚Ä¢‚Äù‚Äì‚Äì√ü¬†¬±¬∫‚Ä∞¬£¬®¬µ‚Ä¢≈í¬™‚à´¬°‚àö√é¬∞¬£‚â•¬®œÄÀù‚àè‚àö¬†¬±¬∫‚Ä∞¬µ∆íŒ©¬∑œÄÀöŒ©¬¥¬±¬™‚Ä¶¬∑‚àÜÀô¬£¬®
		                  ‚â•¬®¬†¬±¬†¬±¬∫‚Ä∞¬µŒ©¬•√î‚à´√õ¬™√ø¬µÀú‚à´√ò¬†Àù√∑‚ÄìŒ©¬¥¬µ‚àö¬µŒ©‚â•¬®¬†¬±√É¬∑¬†√¶‚óäÀú≈í‚Ñ¢√Ä‚Äî√ÄÀúŒ©¬∑¬†¬Ø¬±√ç√∑√¶¬∞¬£
						  ¬ª√ÅœÄÀö‚â§¬™≈ì√é¬†œÄ‚Äù‚àöSDK‚â•¬®¬†¬±¬•¬∂¬ø√å√∏‚Ä¶‚Äú‚Äò√∑‚àö≈í‚Ñ¢0¬£¬®¬•√Ä¬†¬±Œ©¬∑œÄÀö¬´√∏¬ª¬¥‚â§√∏‚àë¬µ¬™√ø‚àè¬Ø¬µÀú‚Äù‚àö‚ÄôÔ¨Ç¬∞¬£
*‚àë¬µ¬™√ø√∑¬µ: ≈íÔ¨Å
*‚àÜ‚Ä∞√ÄÀö  : ∆í√∏¬´‚àû‚àè‚àöœÄ¬∂∆í‚Äπ‚Äò‚Ä∫‚â§¬™√∑√ü‚â•√∑‚â§¬¢‚àë¬¢œÄ‚Äû‚â§‚Ä¢¬£¬®¬∫¬•‚â§¬¢‚àë¬¢¬µÀú‚Äù‚àö¬†¬±‚óä√ì‚à´√õ‚Äú¬™¬•≈íœÄ‚Äû‚â§‚Ä¢Œ©¬¥‚àè‚â§‚àè¬´√∑√Ü¬´‚àû¬µ∆íœÄ‚Äû‚â§‚Ä¢
*****************************************************************************/
#ifndef WIN32
	JVCLIENT_API int JVC_BroadcastOnce(int nBCID, unsigned char *pBuffer, int nSize, int nTimeOut);
#else
	JVCLIENT_API BOOL __stdcall JVC_BroadcastOnce(int nBCID, unsigned char  *pBuffer, int nSize, int nTimeOut);
#endif

/****************************************************************************
*‚àöÀö‚â•‚àÜ  : JVC_ClearBuffer
*œÄ¬∂∆í‚Äπ  : ¬´√Ç√∏‚Äô¬±√¶¬µ√ø¬™‚à´¬•√ä
*‚â§≈í¬†Àù  : [IN] nLocalChannel ‚àëÀõ≈í√í√ï¬Æ¬µ¬ø‚à´‚âà >=1
*‚àë¬µ¬™√ø√∑¬µ: ≈íÔ¨Å
*‚àÜ‚Ä∞√ÄÀö  : Œ©ÀÜ‚àÇ‚Äò‚àÜ‚Äô√ï¬Æ∆í¬£¬†Œ©¬°¬•Œ©‚Äù‚Äù‚Äì‚Äì√ü¬£¬®‚àÇ‚Ä°‚â§‚Ä¢¬°¬®Œ©‚Äù‚â§¬™‚Äò¬†‚Äì√å¬•‚Äù¬±√¶¬µ√ø¬´√Ç√∏‚Äô
*****************************************************************************/
#ifndef WIN32
	JVCLIENT_API void JVC_ClearBuffer(int nLocalChannel);
#else
	JVCLIENT_API void __stdcall	JVC_ClearBuffer(int nLocalChannel);
#endif

/****************************************************************************
*‚àöÀö‚â•‚àÜ  : JVC_EnableHelp
*œÄ¬∂∆í‚Äπ  : ‚àÜ√ô‚Äù‚àö/√ï¬£‚Äù‚àö√∏√è√Ä≈∏¬°¬•Œ©‚Äù‚àëÀõ≈í√í
*‚â§≈í¬†Àù  : [IN] bEnable TRUE√∏‚Ñ¢‚àÜ√ô/FALSEœÄ√ø¬±‚Äô
         [IN] nType  ¬µ¬±¬´‚àû¬†œÄ‚Äù‚àö‚ÄôÔ¨Ç¬†¬´√Ä‚â†¬£¬®¬µ¬±bEnable≈í‚Ñ¢TRUE¬†¬±‚Äù‚Äì‚Äì√ü
		             1 ¬µ¬±¬´‚àû¬†œÄ‚Äù‚àö‚ÄôÔ¨Ç¬†¬´‚Äò‚àÜ¬†‚Äù√ï¬Æ‚Äì¬∞√∑Àô¬†√∑(‚àÇ¬ø¬°¬¢Œ©¬Ø‚â•√É)
		             2 ¬µ¬±¬´‚àû¬†œÄ‚Äù‚àö‚ÄôÔ¨Ç¬†¬´‚Äò‚àÜ¬†‚Äù√ï¬Æ√∏√ï¬™√ü‚àÇ√Ä¬£¬®√∑√ü‚â•√∑‚àÇ¬ø¬°¬¢Œ©¬Ø‚â•√É¬µ∆í‚Äì¬∞√∑Àô¬†√∑
		             3 ¬µ¬±¬´‚àû¬†œÄ‚Äù‚àö‚ÄôÔ¨Ç¬†¬´‚Äò‚àÜ¬†‚Äù√ï¬Æ√∏√ï¬™√ü‚àÇ√Ä¬£¬®‚â§¬™√∑√ü‚â•√∑‚àÇ¬ø¬°¬¢Œ©¬Ø‚â•√É¬µ∆í‚Äì¬∞√∑Àô¬†√∑
*‚àë¬µ¬™√ø√∑¬µ: ≈íÔ¨Å
*‚àÜ‚Ä∞√ÄÀö  : ‚àÜ√ô‚Äù‚àö‚àè‚àöœÄ¬∂∆í‚Äπ‚à´√õ¬£¬®√ï¬Ø¬¨√ÅSDK¬™¬∑‚àÇ‚Äò‚Ä¶√ã‚àÇ¬Æ¬µ∆í‚à´‚âà¬¨√éŒ©¬Ø‚Äì‚Äì¬°¬®Œ©‚Äù√É¬∑√Ä≈∏¬µ¬ª‚Äù‚âà¬™√ò¬£¬™
		 ‚àÜ√ô‚Äù‚àö‚àè‚àöœÄ¬∂∆í‚Äπ‚à´√õ¬£¬®√ï¬Ø¬¨√ÅSDK¬™¬∑√∑√ü‚â•√∑‚Äì¬∞√∑Àô¬†√∑‚à´√ï√∏√ï¬™√ü‚àÇ√Ä√∑√Ü¬∫‚Ä∞Œ©¬Ø‚Äì‚ÄìŒ©¬™¬™‚Ä¢¬£¬™
		 ¬ª√ÅœÄÀö‚àë√∑√∏√ø‚àÇ√Ä√∑√ü‚â•√∑‚Äì¬∞√∑Àô¬†√∑Œ©¬Ø‚â•√É¬£¬®‚Äò√ö‚Äù‚àö‚Äì¬∞√∑Àô¬†√∑‚àÇ√Ä¬†œÄ‚Äù‚àönType=1¬£¬®√∏√ï¬™√ü‚àÇ√Ä¬†œÄ‚Äù‚àönType=2¬∫¬•√∏‚Ä¶¬£¬™
		 ¬ª√ÅœÄÀö√∏√ï¬™√ü‚àÇ√Ä‚â§¬™√∑√ü‚â•√∑‚Äì¬∞√∑Àô¬†√∑Œ©¬Ø‚â•√É¬£¬®‚Äò√ö√∏√ï¬™√ü‚àÇ√Ä¬†œÄ‚Äù‚àönType=3¬∫¬•√∏‚Ä¶¬£¬®¬±¬ª¬ª√Å¬†√∑¬™Àô√∏√ï¬™√ü‚àÇ√Ä¬£¬™
*****************************************************************************/
#ifndef WIN32
	JVCLIENT_API int JVC_EnableHelp(int bEnable, int nType);
#else
	JVCLIENT_API BOOL __stdcall JVC_EnableHelp(BOOL bEnable, int nType);
#endif

/****************************************************************************
*‚àöÀö‚â•‚àÜ  : JVC_SetHelpYSTNO
*œÄ¬∂∆í‚Äπ  : ‚Ä¶√ã√∑‚àö‚àÇ‚Äò∆í‚â•‚Äì¬©‚Äò‚àÜ¬†‚Äù√ï¬Æ‚à´‚âà¬¨√é¬µ∆í‚àè¬Æ√∑Àô√∑√ü‚â•√∑
*‚â§≈í¬†Àù  : [IN] pBuffer ‚Äò‚àÜ¬†‚Äù√ï¬Æ‚à´‚âà¬¨√é¬∫√ò‚à´≈ì¬£¬®‚Äù‚Ä¶STBASEYSTNOŒ©¬∑œÄœÄ‚óä√à‚â•‚Ä¶¬£¬™¬±¬ª¬ª√Å‚Äù‚Äì¬°Œ©‚àèÀÜ‚à´‚âà¬¨√é
                      STBASEYSTNO st1,STBASEYSTNO st1;
					  pBuffer¬µ∆í∆í‚ÅÑ¬ª‚Ä∫√¶√ï¬†¬´:
					  memcpy(bBuffer, &st1, sizeof(STBASEYSTNO));
					  memcpy(&bBuffer[sizeof(STBASEYSTNO)], &st2, sizeof(STBASEYSTNO));
         [IN] nSize   pBuffer¬µ∆í¬†¬µ¬∫¬†‚Äù‚Äì‚Äì√ü‚â•¬ß‚àÇ¬ª¬£¬™¬ª√ÅœÄÀö¬†¬´¬°Œ©‚àèÀÜ‚à´‚âà¬¨√é‚Äò√ö≈í‚Ñ¢¬£‚à´
		              2*sizeof(STBASEYSTNO);

*‚àë¬µ¬™√ø√∑¬µ: ≈íÔ¨Å
*‚àÜ‚Ä∞√ÄÀö  : ‚Äò‚àÜ¬†‚Äù√ï¬Æ‚Äì¬∞√∑Àô¬†√∑‚àÇ√Ä¬†œÄ‚Äù‚àö¬£¬™
         √∏√ï¬™√ü‚àÇ√Ä‚â§¬™√∑√ü‚â•√∑‚Äì¬∞√∑Àô¬†√∑¬†¬±√∏√ï¬™√ü‚àÇ√Ä¬†œÄ‚Äù‚àö¬£¬™

         √É√å¬∫‚Äù‚à´√õ¬£¬®√ï¬Ø¬¨√ÅSDK¬™¬∑‚àÇ‚Äò‚Äô‚Äö‚Äì¬©‚Äò‚àÜ¬†‚Äù√ï¬Æ‚à´‚âà¬¨√éŒ©¬Ø‚Äì‚Äì¬°¬®Œ©‚Äù√É¬∑√Ä≈∏¬µ¬ª‚Äù‚âà¬™√ò¬£¬™
		 ‚Äô‚Äö¬†¬´‚â•ƒ±¬†¬∫‚Ä¶√ã√∑‚àö¬£¬®‚â•√É‚Äì√ö‚Äò√Ä‚Äì‚Äì√∑‚Äì√∏√ï¬™√ü‚àÇ√Ä‚Äú‚â§¬™¬∑‚Äù‚Äì‚Äì¬©‚Äì¬¨¬µ∆í‚à´‚âà¬¨√é¬£¬®
		 ¬™¬∑‚àÇ√ò√É¬®√É√å¬∫‚Äù¬µŒ©∆í‚ÅÑ‚â§√∏¬£¬™
		 STBASEYSTNOS ‚Äò‚àÜ¬†‚Äù√ï¬Æ‚à´‚âà¬¨√é,STYSTNO‚àÇ¬Æ‚Äú√Ç‚â§≈í√∏¬•JVNSDKDef.h
*****************************************************************************/
#ifndef WIN32
	JVCLIENT_API int JVC_SetHelpYSTNO(unsigned char *pBuffer, int nSize);
#else
	JVCLIENT_API BOOL __stdcall JVC_SetHelpYSTNO(unsigned char  *pBuffer, int nSize);
#endif

/****************************************************************************
*‚àöÀö‚â•‚àÜ  : JVC_GetHelpYSTNO
*œÄ¬∂∆í‚Äπ  : ¬™√í¬ª¬∞¬µ¬±¬´‚àû‚Äú‚Äî√∑‚Ñ¢¬µ∆í‚Äò‚àÜ¬†‚Äù√ï¬Æ‚à´‚âà¬¨√é¬´√Ç¬µ‚Ä¢
*‚â§≈í¬†Àù  : [IN/OUT] pBuffer ‚Äù‚Ä¶¬µÀú‚Äù‚àö‚ÄôÔ¨Ç√∏‚Ñ¢¬±≈∏∆í‚ÅÑ¬•√ä¬£¬™
                          ‚àë¬µ¬™√ø‚Äò‚àÜ¬†‚Äù√ï¬Æ‚à´‚âà¬¨√é¬∫√ò‚à´≈ì¬£¬®‚Äù‚Ä¶STBASEYSTNOŒ©¬∑œÄœÄ‚óä√à‚â•‚Ä¶¬£¬™¬±¬ª¬ª√Å‚Äù‚Äì¬°Œ©‚àèÀÜ‚à´‚âà¬¨√é
                          STBASEYSTNO st1,STBASEYSTNO st1;
                          pBuffer¬µ∆í∆í‚ÅÑ¬ª‚Ä∫√¶√ï¬†¬´:
                          memcpy(bBuffer, &st1, sizeof(STBASEYSTNO));
                          memcpy(&bBuffer[sizeof(STBASEYSTNO)], &st2, sizeof(STBASEYSTNO));
         [IN/OUT] nSize   ¬µÀú‚Äù‚àö¬†¬±¬•¬¥¬ª√é¬µ∆í¬†¬´pBuffer¬µ∆í¬†¬µ¬∫¬†√∏‚Ñ¢¬±≈∏‚â•¬ß‚àÇ¬ª¬£¬®
		                  ¬µÀú‚Äù‚àö‚à´√õ‚àë¬µ¬™√ø¬µ∆í¬†¬´pBuffer¬µ∆í¬†¬µ¬∫¬†‚Äù‚Äì‚Äì√ü‚â•¬ß‚àÇ¬ª¬£¬™¬ª√ÅœÄÀö¬†¬´¬°Œ©‚àèÀÜ‚à´‚âà¬¨√é‚Äò√ö≈í‚Ñ¢¬£‚à´
                          2*sizeof(STBASEYSTNO);
*‚àë¬µ¬™√ø√∑¬µ: -1  ¬•√å≈í√õ¬£¬®‚â§≈í¬†Àù‚Äù‚Äì≈í√õ¬£¬®pBuffer≈í‚Ñ¢√∏‚Äô¬™√ö¬†¬´¬•√õ‚Äì¬∞‚â§¬™‚óä‚Äû‚Äú‚Äò¬•√ä¬•¬¢Œ©¬∑œÄÀö¬£¬™
          0  ‚àëÀõ≈í√í≈í¬•√∏‚Ñ¢‚àÜ√ô
          1  ‚â•‚Ä¶œÄ¬∂
*‚àÜ‚Ä∞√ÄÀö  : ‚Äò‚àÜ¬†‚Äù√ï¬Æ‚Äì¬∞√∑Àô¬†√∑‚àÇ√Ä¬†œÄ‚Äù‚àö¬£¬™
         √∏√ï¬™√ü‚àÇ√Ä‚â§¬™√∑√ü‚â•√∑‚Äì¬∞√∑Àô¬†√∑¬†¬±√∏√ï¬™√ü‚àÇ√Ä¬†œÄ‚Äù‚àö¬£¬™

         ‚Äô‚Äö¬†¬´‚â•√É‚Äì√ö‚Äò√Ä‚Äì‚Äì√∑‚Äì‚Äú‚Äî√∑‚Ñ¢¬µ∆í√ÄÀò‚Äù‚Äì‚à´‚âà¬¨√é¬£¬®¬∫¬•‚Äì¬∞√∑Àô¬†√∑¬™¬∑‚àÇ‚Äò‚Äô‚Äö‚Äì¬©‚à´‚âà¬¨√éŒ©¬Ø‚Äì‚Äì¬°¬®Œ©‚Äù‚Äù‚âà¬™√ò√∑√ü‚â•√∑¬£¬™
		 ‚àè‚àöŒ©‚Äù√∏‚ÅÑŒ©ÀÜ‚Äù‚àö‚Äù‚ÅÑ‚â§√à‚Äî√ò¬£¬®‚Äù‚Ä¶‚Äù‚ÅÑ∆í‚ÅÑ‚â§√∏¬™¬∑‚óä‚Äò‚àÇ√ò√É√å¬∫‚Äù¬£¬®‚â§√à‚Äî√òŒ©¬∑œÄÀö‚â§¬™¬™¬∑‚â•¬ß‚àÜ‚ÅÑ‚Äù‚Äì‚Äì√ü¬£¬™
		 STBASEYSTNOS ‚Äò‚àÜ¬†‚Äù√ï¬Æ‚à´‚âà¬¨√é,STYSTNO‚àÇ¬Æ‚Äú√Ç‚â§≈í√∏¬•JVNSDKDef.h
*****************************************************************************/
#ifndef WIN32
	JVCLIENT_API int JVC_GetHelpYSTNO(unsigned char *pBuffer, int *nSize);
#else
	JVCLIENT_API int __stdcall JVC_GetHelpYSTNO(unsigned char  *pBuffer, int &nSize);
#endif

/****************************************************************************
*‚àöÀö‚â•‚àÜ  : JVC_GetYSTStatus
*œÄ¬∂∆í‚Äπ  : ¬™√í¬ª¬∞∆í‚â•‚àèÀÜ‚Äò‚àÜ¬†‚Äù√ï¬Æ‚à´‚âà¬¨√é¬µ∆í‚Äò‚ÅÑ≈ìÔ¨Ç‚óä¬•√É¬®
*‚â§≈í¬†Àù  : [IN] chGroup  ‚Äò‚àÜ¬†‚Äù√ï¬Æ‚à´‚âà¬¨√é¬µ∆í¬±‚Ä°‚óä√à‚à´‚âà¬£¬™
         [IN] nYSTNO   ‚Äò‚àÜ¬†‚Äù√ï¬Æ‚à´‚âà¬¨√é
		 [IN] nTimeOut ‚â•¬®¬†¬±¬†¬±¬∫‚Ä∞(‚àö√é)¬£¬®Œ©¬Æ‚Äú√à>=2‚àö√é
*‚àë¬µ¬™√ø√∑¬µ: -1  ¬•√å≈í√õ¬£¬®‚â§≈í¬†Àù‚Äù‚Äì≈í√õ¬£¬®chGroup≈í‚Ñ¢√∏‚Äô¬™√ö¬†¬´nYSTNO<=0¬£¬™
          0  ¬±√¶¬µ√ø‚â§√à‚Äî√ò√É¬¥‚àÜ¬µ‚àë¬±¬£¬®‚Ä¶‚Äò‚à´√õ√∑√ø¬†‚Äò
          1  ‚à´‚âà¬¨√é‚Äò‚ÅÑ≈ìÔ¨Ç
		  2  ‚à´‚âà¬¨√é‚â§¬™‚Äò‚ÅÑ≈ìÔ¨Ç
		  3  ‚â§√à‚Äî√ò¬†√ü‚àû‚Äπ¬£¬®¬™œÄ‚â§¬™∆í‚Äπ‚âà‚Äì‚àÇ¬Æ‚à´‚âà¬¨√é¬†¬´‚àë√í‚Äò‚ÅÑ≈ìÔ¨Ç
*‚àÜ‚Ä∞√ÄÀö  : 1.‚óä¬¢‚Äú‚Äö¬£¬®‚àè‚àö‚à´√ò¬†Àù∆í√∏¬´‚àûŒ©ÀÜ≈ìÔ¨Å‚Äù‚àö‚Äù‚ÅÑ¬†√∑¬™Àô,pc‚àÇ√Ä‚Äò‚Ä∫‚â§¬™‚Äò¬†‚Äì√å¬†œÄ‚Äù‚àö¬£¬™
         2.‚àè‚àö‚à´√ò¬†Àù‚àÇ‚Äò√ï¬®‚Äú¬™‚àèÀÜ‚à´‚âà¬¨√é‚â§¬™‚Äò¬†‚Äì√å‚àÜ¬µ‚àë¬±¬µÀú‚Äù‚àö¬£¬®¬∫‚Ä∞‚àè√ô>=10s;
		 3.‚àè‚àö‚à´√ò¬†Àù‚àÇ‚Äò‚â§¬™√ï¬®‚à´‚âà¬¨√é‚â§¬™‚Äò¬†‚Äì√å‚àÜ¬µ‚àë¬±¬µÀú‚Äù‚àö¬£¬®¬∫‚Ä∞‚àè√ô>=1s;
*****************************************************************************/
#ifndef WIN32
	JVCLIENT_API int JVC_GetYSTStatus(char chGroup[4], int nYSTNO, int nTimeOut);
#else
	JVCLIENT_API int __stdcall JVC_GetYSTStatus(char chGroup[4], int nYSTNO, int nTimeOut);
#endif

/****************************************************************************
*‚àöÀö‚â•‚àÜ  : JVC_EnableLANTool
*œÄ¬∂∆í‚Äπ  : √∏‚Ñ¢‚àÜ√ô‚àëÀõ≈í√í√∏‚Ä¶‚Äú‚Äò√Ä‚Äî√ÄÀú‚âà‚Ä∞√∑‚àö√¶√∑‚Äù√ö√ï¬Ø√∑‚Äì¬µ∆í‚Ä¶√ã¬±‚àè
*‚â§≈í¬†Àù  : [IN] nEnable     1√∏‚Ñ¢‚àÜ√ô 0œÄ√ø¬±‚Äô
         [IN] nLPort      ¬±√¶¬µ√ø‚àëÀõ≈í√í‚àÇ√Ä√∏‚ÅÑ¬£¬®<0¬†¬±≈í‚Ñ¢∆í¬®¬ª≈ì9600
         [IN] nServerPort ‚Ä¶√ã¬±‚àè‚àÇ√Ä‚àëÀõ≈í√í‚àÇ√Ä√∏‚ÅÑ¬£¬®<=0¬†¬±≈í‚Ñ¢∆í¬®¬ª≈ì9104,Œ©¬Æ‚Äú√à√ï‚â•‚Äú¬™‚Äù‚àö∆í¬®¬ª≈ì√∑¬µ‚Äù√é‚àëÀõ≈í√í‚àÇ√Ä‚àÜ‚Ä¢‚âà‚Ä∞
		 [IN] LANTData    √Ä‚Äî√ÄÀúŒ©¬∑œÄÀö¬™√ø¬µÀú‚à´√ò¬†Àù
*‚àë¬µ¬™√ø√∑¬µ: 0¬†√ü‚àû‚Äπ/1‚â•‚Ä¶œÄ¬∂
*‚àÜ‚Ä∞√ÄÀö  : √∏‚Ñ¢‚àÜ√ô¬°√Ä√Ä‚Äî√ÄÀú‚àëÀõ≈í√í‚â§‚âà√∏‚Ä¶‚Äú‚ÄòŒ©‚Äù¬†‚Äô√Ä‚Äî√ÄÀúŒ©¬∑œÄÀö¬£¬®√Ä‚Äî√ÄÀú√Éƒ±¬∫Àõ√ï¬ÆœÄÀùJVC_LANToolDeviceŒ©‚Äù√∏‚ÅÑ√∑‚àè‚àÇ¬Æ
*****************************************************************************/
#ifndef WIN32
	JVCLIENT_API int JVC_EnableLANTool(int nEnable, int nLPort, int nServerPort, FUNC_CLANTDATA_CALLBACK LANTData);
#else
	JVCLIENT_API int __stdcall	JVC_EnableLANTool(int nEnable, int nLPort, int nServerPort, FUNC_CLANTDATA_CALLBACK LANTData);
#endif

/****************************************************************************
*‚àöÀö‚â•‚àÜ  : JVC_LANToolDevice
*œÄ¬∂∆í‚Äπ  : √Ä‚Äî√ÄÀú√¶√∑‚Äù√ö√ï¬Ø√∑‚Äì¬µ∆í√∏‚Ä¶‚âà‚Ä∞√∑‚àö‚Ä¶√ã¬±‚àè
*‚â§≈í¬†Àù  : [IN] chPName     ‚Äù‚àö¬™√ü‚àöÀö
		 [IN] chPWord     ‚àö‚Äπ¬¨√é¬£¬®¬†œÄ‚Äù‚àö‚Äù‚àö¬™√ü‚àöÀö‚àö‚Äπ¬¨√é√∏‚Ä¶√É¬∑‚àèÔ¨ÇIPC¬µ∆í‚àû‚â§¬ª¬¥‚Äì‚Äò¬£¬®¬∫¬•‚âà‚Ä∞√∑‚àö‚Äú‚â§¬†¬´‚Äì√ã‚Äú‚Ñ¢¬ª¬Æ≈ìÔ¨Å¬µ∆í
         [IN] nTimeOut    ¬±√¶¬µ√ø√Ä‚Äî√ÄÀú‚Äù‚Äì‚Äì√ü¬†¬±¬∫‚Ä∞¬£¬®¬µ‚Ä¢≈í¬™‚à´¬°‚àö√é¬∞¬£‚â•¬®œÄÀù‚àè‚àö¬†¬±¬∫‚Ä∞¬µ∆íŒ©¬∑œÄÀöŒ©¬¥¬±¬™‚Ä¶¬∑‚àÜÀô¬£¬®
		                  ‚â•¬®¬†¬±¬†¬±¬∫‚Ä∞¬µŒ©¬•√î‚à´√õ¬™√ø¬µÀú‚à´√ò¬†Àù√∑‚ÄìŒ©¬¥¬µ‚àö¬µŒ©‚â•¬®¬†¬±√É¬∑¬†√¶‚óäÀú≈í‚Ñ¢√Ä‚Äî√ÄÀúŒ©¬∑¬†¬Ø¬±√ç√∑√¶¬∞¬£
						  ¬ª√ÅœÄÀö‚â§¬™≈ì√é¬†œÄ‚Äù‚àöSDK‚â•¬®¬†¬±¬•¬∂¬ø√å√∏‚Ä¶‚Äú‚Äò√∑‚àö≈í‚Ñ¢0¬£¬®¬•√Ä¬†¬±Œ©¬∑œÄÀö¬´√∏¬ª¬¥‚â§√∏‚àë¬µ¬™√ø‚àè¬Ø¬µÀú‚Äù‚àö‚ÄôÔ¨Ç¬∞¬£

						  √ï¬®√ï¬Ø‚àÇ≈í¬µ∆í‚Ä¶√ã¬±‚àè‚Äú¬™‚àû‚Äû∆í‚Äπ‚Äò‚ÅÑ<500¬µ∆í¬†¬±¬∫‚Ä∞∆í‚ÅÑ√Ä‚Äî√ÄÀú¬µŒ©¬£¬™
						  ‚Ä¶√ã¬±‚àè√Ä‚Äî√ÄÀúŒ©¬Æ‚Äú√à√∑¬°‚Ä¶≈∏‚Ä¶√ã√∑‚àö2000¬£¬®¬ª‚àë¬±¬£√Ä‚Äî√ÄÀú¬µ∆í√ï¬Ø‚àÇ≈í¬ª¬¥‚àö√ä¬£¬™
						  ¬∫¬•‚â§√Ç¬∫¬•‚Äù‚àö√Ä‚Äî√ÄÀú√∏‚Ä¶‚àèÀò√¶‚Ä∫‚Äì√ã‚Äú‚Ñ¢‚â•¬ß¬™√ö‚àÇ√É¬£¬®‚ÄòŒ©‚àÇ√É‚ÄòŒ©√∏‚Ä¶∆í‚Äπ‚Äú‚âà¬¨¬©‚â§¬™√ï¬®√ï¬Ø‚àÇ≈í¬µ∆í‚Ä¶√ã¬±‚àè¬£¬™
*‚àë¬µ¬™√ø√∑¬µ: ≈íÔ¨Å
*‚àÜ‚Ä∞√ÄÀö  : ≈íÔ¨Å
*****************************************************************************/
#ifndef WIN32
	JVCLIENT_API int JVC_LANToolDevice(char chPName[256], char chPWord[256], int nTimeOut);
#else
	JVCLIENT_API int __stdcall	JVC_LANToolDevice(char chPName[256], char chPWord[256], int nTimeOut);
#endif

/****************************************************************************
*‚àöÀö‚â•‚àÜ  : JVC_SendCMD
*œÄ¬∂∆í‚Äπ  : ≈ì√ö√∑Àú√∏√ø‚àÇ√Ä‚àë¬¢√Ä√ï‚Äú¬™‚Äì¬©√É√ø¬†‚Äö‚àö¬∏¬°√ì
*‚â§≈í¬†Àù  : [IN] nLocalChannel   ¬±√¶¬µ√ø√ï¬Æ¬µ¬ø‚à´‚âà >=1
		 [IN] uchType         ¬†Àù√¶‚Ä∫¬ø‚Ä°‚Äì√ï
		 [IN] pBuffer         ¬•Àù‚àë¬¢¬†Àù√¶‚Ä∫∆í‚ÅÑ¬ª‚Ä∫
		 [IN] nSize           ¬•Àù‚àë¬¢¬†Àù√¶‚Ä∫‚â•¬ß‚àÇ¬ª
*‚àë¬µ¬™√ø√∑¬µ: 0  ‚àë¬¢√Ä√ï¬†√ü‚àû‚Äπ
         1  ‚àë¬¢√Ä√ï‚â•‚Ä¶œÄ¬∂
		 2  ‚àÇ‚Äò‚àëŒ©‚â§¬™√∑√ü‚â•√∑‚àè‚àö‚àö¬∏¬°√ì
*‚àÜ‚Ä∞√ÄÀö  : Œ©ÀÜ‚àÇ‚Äò‚àÜ‚Äô√ï¬Æ∆í¬£¬†Œ©¬°¬•Œ©‚Äù‚Äù‚Äì‚Äì√ü¬£¬™
         ¬µ¬±¬´‚àû√∑√ü‚â•√∑¬µ∆í‚Äù‚Äì:√∑¬™‚àë¬¢œÄ√ø¬∫¬∏√∑¬∞‚àö¬∏¬°√ìJVN_CMD_ONLYI
		              ‚à´√ï¬™√∑‚àè¬•¬¨Àô√∑¬∞‚àö¬∏¬°√ìJVN_CMD_FULL
*****************************************************************************/
#ifndef WIN32
	JVCLIENT_API int JVC_SendCMD(int nLocalChannel, unsigned char uchType, unsigned char  *pBuffer, int nSize);
#else
	JVCLIENT_API int __stdcall	JVC_SendCMD(int nLocalChannel, unsigned char  uchType, unsigned char  *pBuffer, int nSize);
#endif

/****************************************************************************
*‚àöÀö‚â•‚àÜ  : JVC_AddFSIpSection
*œÄ¬∂∆í‚Äπ  : ‚ÄòÀÜ¬∫‚Äù‚óä‚Äò‚àÇ¬Æ‚Äú√ÇIP‚àÇ≈í¬£¬®‚Äú‚ÄòœÄ¬©‚Äù‚âà≈ì¬ª√Ä‚Äî√ÄÀú ,‚Äù‚âà≈ì¬ª√Ä‚Äî√ÄÀú√∑‚àè‚àÇ¬Æ¬µ∆íIP‚àÇ≈í first search
*‚â§≈í¬†Àù  : [IN] pStartIp		  IPSECTION¬†Àù‚óä√à¬µ√ø√∑‚àë
		 [IN] nSize           IP‚àÇ≈í¬†Àù*sizeof(IPSECTION)
		 [IN] bEnablePing     ‚Äò‚Ä∫√ï¬£¬∞¬¢¬∫√É‚Äì¬Ø ping≈ìÔ¨Ç‚â•√É 
*‚àë¬µ¬™√ø√∑¬µ: 0¬£¬®‚â•‚Ä¶œÄ¬∂ -1 ¬†√ü‚àû‚Äπ
*‚àÜ‚Ä∞√ÄÀö  : ≈íÔ¨Å
*****************************************************************************/
#ifndef WIN32
 	JVCLIENT_API int JVC_AddFSIpSection( const IPSECTION * pStartIp, int nSize ,int bEnablePing );
#else
 	JVCLIENT_API int __stdcall	JVC_AddFSIpSection( const IPSECTION * pStartIp, int nSize ,BOOL bEnablePing );
 
#endif

/****************************************************************************
*‚àöÀö‚â•‚àÜ  : JVC_MOLANSerchDevice
*œÄ¬∂∆í‚Äπ  : ¬†√∑¬™Àô√Ä‚Äî√ÄÀú√¶√∑‚Äù√ö√ï¬Ø√∑‚Äì≈í¬®‚Ä¶√ã¬±‚àè
*‚â§≈í¬†Àù  : [IN] chGroup     ¬±‚Ä°‚óä√à‚à´‚âà¬£¬®¬±‚Ä°‚óä√à‚à´‚âà+nYSTNO√∏‚Ä¶¬ª‚àë‚àÇ¬Æ≈í¬Æ‚Äú¬™‚Ä¶√ã¬±‚àè
         [IN] nYSTNO      √Ä‚Äî√ÄÀú√¶Ô¨Ç‚Äù‚Äì∆í‚â•‚Äò‚àÜ¬†‚Äù√ï¬Æ‚à´‚âà¬¨√é¬µ∆í‚Ä¶√ã¬±‚àè¬£¬®>0‚Äù‚Äì‚Äì√ü
         [IN] nCardType   √Ä‚Äî√ÄÀú∆í‚â•‚Äì√ï‚à´‚âà¬µ∆í‚Ä¶√ã¬±‚àè¬£¬®>0‚Äù‚Äì‚Äì√ü,¬µ¬±nYSTNO>0¬†¬±‚àè‚àö‚â§≈í¬†Àù≈íÔ¨Å‚Äì√ü
		 [IN] chDeviceName√Ä‚Äî√ÄÀú∆í‚â•‚àèÀÜ¬±Ô£ø‚àöÀö¬µ∆í‚Ä¶√ã¬±‚àè¬£¬®strlen>0‚Äù‚Äì‚Äì√ü¬£¬®¬µ¬±nYSTNO>0¬†¬±≈íÔ¨Å‚Äì√ü
		 [IN] nVariety    √Ä‚Äî√ÄÀú∆í‚â•‚àèÀÜ¬ø‚Ä°¬±Ô£ø¬µ∆í‚Ä¶√ã¬±‚àè¬£¬®1‚àû√Ç√∏¬Æ;2DVR;3IPC;>0‚Äù‚Äì‚Äì√ü,¬µ¬±nYSTNO>0¬†¬±‚àè‚àö‚â§≈í¬†Àù≈íÔ¨Å‚Äì√ü
		 [IN] nTimeOut    ¬±√¶¬µ√ø√Ä‚Äî√ÄÀú‚Äù‚Äì‚Äì√ü¬†¬±¬∫‚Ä∞¬£¬®¬µ‚Ä¢≈í¬™‚à´¬°‚àö√é¬∞¬£‚â•¬®œÄÀù‚àè‚àö¬†¬±¬∫‚Ä∞¬µ∆íŒ©¬∑œÄÀöŒ©¬¥¬±¬™‚Ä¶¬∑‚àÜÀô¬£¬®
		                  ‚â•¬®¬†¬±¬†¬±¬∫‚Ä∞¬µŒ©¬•√î‚à´√õ¬™√ø¬µÀú‚à´√ò¬†Àù√∑‚ÄìŒ©¬¥¬µ‚àö¬µŒ©‚â•¬®¬†¬±√É¬∑¬†√¶‚óäÀú≈í‚Ñ¢√Ä‚Äî√ÄÀúŒ©¬∑¬†¬Ø¬±√ç√∑√¶¬∞¬£
						  ¬ª√ÅœÄÀö‚â§¬™≈ì√é¬†œÄ‚Äù‚àöSDK‚â•¬®¬†¬±¬•¬∂¬ø√å√∏‚Ä¶‚Äú‚Äò√∑‚àö≈í‚Ñ¢0¬£¬®¬•√Ä¬†¬±Œ©¬∑œÄÀö¬´√∏¬ª¬¥‚â§√∏‚àë¬µ¬™√ø‚àè¬Ø¬µÀú‚Äù‚àö‚ÄôÔ¨Ç¬∞¬£

						  √ï¬®√ï¬Ø‚àÇ≈í¬µ∆í‚Ä¶√ã¬±‚àè‚Äú¬™‚àû‚Äû∆í‚Äπ‚Äò‚ÅÑ<500¬µ∆í¬†¬±¬∫‚Ä∞∆í‚ÅÑ√Ä‚Äî√ÄÀú¬µŒ©¬£¬™
						  ‚Ä¶√ã¬±‚àè√Ä‚Äî√ÄÀúŒ©¬Æ‚Äú√à√∑¬°‚Ä¶≈∏‚Ä¶√ã√∑‚àö2000¬£¬®¬ª‚àë¬±¬£√Ä‚Äî√ÄÀú¬µ∆í√ï¬Ø‚àÇ≈í¬ª¬¥‚àö√ä¬£¬™
						  ¬∫¬•‚â§√Ç¬∫¬•‚Äù‚àö√Ä‚Äî√ÄÀú√∏‚Ä¶‚àèÀò√¶‚Ä∫‚Äì√ã‚Äú‚Ñ¢‚â•¬ß¬™√ö‚àÇ√É¬£¬®‚ÄòŒ©‚àÇ√É‚ÄòŒ©√∏‚Ä¶∆í‚Äπ‚Äú‚âà¬¨¬©‚â§¬™√ï¬®√ï¬Ø‚àÇ≈í¬µ∆í‚Ä¶√ã¬±‚àè¬£¬™
		 [IN] unFrequence (¬µ‚Ä¢≈í¬™≈í‚Ñ¢s )√∑¬•‚Äì‚Äìping √ï¬ØœÄ√ø¬µ∆í‚àÜ¬µ¬¨¬†¬£¬®∆í¬®¬ª≈ì¬´√é√É√ì¬ª√é30s√Ä‚Äî√ÄÀú‚Äú¬™¬•≈í¬£¬®¬´‚àÇ¬ª√é¬†Œ©‚Ä¶√ã¬±‚àè√∏‚Ä¶‚àèÀò√¶‚Ä∫‚Äì√ã‚Äú‚Ñ¢‚àè¬∏‚àè∆í>20&&<24*3600‚Äù‚Äì‚Äì√ü.

*‚àë¬µ¬™√ø√∑¬µ: ≈íÔ¨Å
*‚àÜ‚Ä∞√ÄÀö  : ¬µ¬±¬°Œ©‚â§≈í¬†Àù√ï¬®¬†¬±≈í‚Ñ¢0¬†¬±¬£¬®Œ©¬¥√Ä‚Äî√ÄÀú√¶√∑‚Äù√ö√ï¬Ø√∑‚Äì√ÄÀò‚Äù‚Äì√∑‚Äì≈í¬®‚Ä¶√ã¬±‚àè
*****************************************************************************/
#ifndef WIN32
	JVCLIENT_API int  JVC_MOLANSerchDevice(char chGroup[4], int nYSTNO, int nCardType, int nVariety, char chDeviceName[100], int nTimeOut,unsigned int unFrequence);
#else
	JVCLIENT_API bool __stdcall	JVC_MOLANSerchDevice(char chGroup[4], int nYSTNO, int nCardType, int nVariety, char chDeviceName[100], int nTimeOut,unsigned int unFrequence);
#endif

/**
 * stop lansearch
 */
#ifndef WIN32
	JVCLIENT_API int JVC_MOStopLANSerchDevice();
#else
	JVCLIENT_API int __stdcall	JVC_MOStopLANSerchDevice();
#endif
/****************************************************************************
*‚àöÀö‚â•‚àÜ  : JVC_RegisterCommonCallBack
*œÄ¬∂∆í‚Äπ  : ‚Äò‚àÜ¬†‚Äù√ï¬Æ√∏‚Äö‚Äù√é‚Äù¬∂‚Äù‚àö‚â§‚Äû¬†Àù√¶‚Ä∫Œ©¬™¬™‚Ä¢ ¬™√ø¬µÀú‚óä¬¢‚â§¬∑
*‚â§≈í¬†Àù  : ¬™√ø¬µÀú‚à´√ò¬†Àù

*‚àë¬µ¬™√ø√∑¬µ: ≈íÔ¨Å
*****************************************************************************/

#ifndef WIN32
JVCLIENT_API void JVC_RegisterCommonCallBack(FUNC_COMM_DATA_CALLBACK pfWriteReadDataCallBack);
#else
JVCLIENT_API void __stdcall JVC_RegisterCommonCallBack(FUNC_COMM_DATA_CALLBACK pfWriteReadDataCallBack);
#endif


/****************************************************************************
*‚àöÀö‚â•‚àÜ  : JVC_GetDemo
*œÄ¬∂∆í‚Äπ  : ¬™√í¬ª¬∞‚Äî‚Ä∫¬†√¶¬µ‚Äû
*‚â§≈í¬†Àù  : [OUT] pBuff		  ¬•√ä‚àë‚âà‚â§√à‚Äî√ò¬µ∆í‚à´‚âà¬¨√é¬µ∆í¬°‚Äì¬±√å,∆í‚ÅÑ¬•√ä‚Äù‚Ä¶‚Äù¬∂‚Äù‚àö‚â§‚Äû¬•¬•Œ©¬Æ‚àë√∑‚âà‚Ä∞ ¬±‚Ä°‚óä√à : 4 BYTE ‚à´‚âà¬¨√é : 4 BYTE √ï¬Æ¬µ¬ø¬†Àù : 1 BYTE
         [IN] nBuffSize       ¬•¬•Œ©¬Æ¬µ∆í∆í‚ÅÑ¬•√ä¬•√õ‚Äì¬∞

*‚àë¬µ¬™√ø√∑¬µ: ‚ÄôÀù¬†Àù ‚Äî‚Ä∫¬†√¶¬µ‚Äû¬µ∆í¬†Àù¬°√∏¬£¬®-2 ≈ì¬µ√ï‚â•≈í¬•‚â•ƒ±¬†¬∫¬™√ò -1 ≈í‚Ñ¢∆í‚ÅÑ¬•√ä√É¬¥‚Äì¬∞¬£¬®0 √∏‚Ä¶∆í‚Äπ¬†¬´√ï¬Ø¬¨√Å√∏‚Äö¬™œÄ‚àö¬™‚Äù‚Äì¬™√í¬ª¬∞¬µŒ©
*****************************************************************************/

#ifndef WIN32
JVCLIENT_API int JVC_GetDemo(BYTE* pBuff,int nBuffSize);
#else
JVCLIENT_API int __stdcall JVC_GetDemo(BYTE* pBuff,int nBuffSize);
#endif

/****************************************************************************
*‚àöÀö‚â•‚àÜ  : JVC_HelperRemove
*œÄ¬∂∆í‚Äπ  : ‚Ä¶√¶‚â•Àù√∑Àô¬†√∑∆í‚ÅÑ¬µ∆í‚à´‚âà¬¨√é 
*‚â§≈í¬†Àù  : [IN] chGroup     ¬±‚Ä°‚óä√à‚à´‚âà¬£¬®¬±‚Ä°‚óä√à‚à´‚âà+nYSTNO√∏‚Ä¶¬ª‚àë‚àÇ¬Æ≈í¬Æ‚Äú¬™‚Ä¶√ã¬±‚àè
         [IN] nYSTNO      √Ä‚Äî√ÄÀú√¶Ô¨Ç‚Äù‚Äì∆í‚â•‚Äò‚àÜ¬†‚Äù√ï¬Æ‚à´‚âà¬¨√é¬µ∆í‚Ä¶√ã¬±‚àè¬£¬®>0‚Äù‚Äì‚Äì√ü

*‚àë¬µ¬™√ø√∑¬µ: ≈íÔ¨Å
*****************************************************************************/

#ifndef WIN32
JVCLIENT_API void JVC_HelperRemove(char* pGroup,int nYST);
#else
JVCLIENT_API void __stdcall JVC_HelperRemove(char* pGroup,int nYST);
#endif


/****************************************************************************
*‚àöÀö‚â•‚àÜ  : JVC_HelpQuery
*œÄ¬∂∆í‚Äπ  : ‚â§√à‚Äî√ò√∑Àô¬†√∑¬µ∆í‚à´‚âà¬¨√é¬°¬®Œ©‚Äù‚óä¬•√É¬® 
*‚â§≈í¬†Àù  : [IN] chGroup     ¬±‚Ä°‚óä√à‚à´‚âà¬£¬®¬±‚Ä°‚óä√à‚à´‚âà+nYSTNO√∏‚Ä¶¬ª‚àë‚àÇ¬Æ≈í¬Æ‚Äú¬™‚Ä¶√ã¬±‚àè
         [IN] nYSTNO      √Ä‚Äî√ÄÀú√¶Ô¨Ç‚Äù‚Äì∆í‚â•‚Äò‚àÜ¬†‚Äù√ï¬Æ‚à´‚âà¬¨√é¬µ∆í‚Ä¶√ã¬±‚àè¬£¬®>0‚Äù‚Äì‚Äì√ü
		 [OUT] nCount     √∑Àô¬†√∑¬µ∆í¬†Àù¬°√∏

*‚àë¬µ¬™√ø√∑¬µ: -1 ≈í¬•‚â•ƒ±¬†¬∫¬™√ò 0 ≈í¬•¬°¬®Œ©‚Äù 1 ¬°¬®Œ©‚Äù ∆í‚ÅÑ√ï¬Ø 2 ‚óä‚Ñ¢‚àë¬¢¬°¬®Œ©‚Äù 3 ¬°¬®Œ©‚Äù √ï‚Äö√ï¬Ø
*****************************************************************************/

#ifndef WIN32
JVCLIENT_API int JVC_HelpQuery(char* pGroup,int nYST,int &nCount);
#else
JVCLIENT_API int __stdcall JVC_HelpQuery(char* pGroup,int nYST,int &nCount);
#endif


/****************************************************************************
*‚àöÀö‚â•‚àÜ  : JVC_QueryDevice
*œÄ¬∂∆í‚Äπ  : ‚â§√à‚Äî√ò‚à´‚âà¬¨√é¬†¬´‚àë√í‚Äú‚Äî√¶‚â†√Ä‚Äî√ÄÀú‚â•ÀÜ¬ø¬• 
*‚â§≈í¬†Àù  : [IN] chGroup     ¬±‚Ä°‚óä√à‚à´‚âà¬£¬®¬±‚Ä°‚óä√à‚à´‚âà+nYSTNO√∏‚Ä¶¬ª‚àë‚àÇ¬Æ≈í¬Æ‚Äú¬™‚Ä¶√ã¬±‚àè
         [IN] nYSTNO      √Ä‚Äî√ÄÀú√¶Ô¨Ç‚Äù‚Äì∆í‚â•‚Äò‚àÜ¬†‚Äù√ï¬Æ‚à´‚âà¬¨√é¬µ∆í‚Ä¶√ã¬±‚àè¬£¬®>0‚Äù‚Äì‚Äì√ü
         [IN] nTimeOut    ‚â•¬®¬†¬±¬†¬±¬∫‚Ä∞¬µ‚Ä¢≈í¬™‚à´¬°‚àö√é
		 [IN] callBack    ¬™√ø¬µÀú‚à´√ò¬†Àù

*‚àë¬µ¬™√ø√∑¬µ: 0 ¬•√å≈í√õ 1 ‚â•‚Ä¶œÄ¬∂ ¬µ¬ª¬•Àù¬™√ø¬µÀú
*****************************************************************************/

#ifndef WIN32
JVCLIENT_API int JVC_QueryDevice(char* pGroup,int nYST,int nTimeOut,FUNC_DEVICE_CALLBACK callBack);
#else
JVCLIENT_API int __stdcall JVC_QueryDevice(char* pGroup,int nYST,int nTimeOut,FUNC_DEVICE_CALLBACK callBack);
#endif

    

    JVCLIENT_API void JVC_DeleteErrorLog();

    

#ifndef WIN32
JVCLIENT_API char* JVC_GetVersion( );
#else
JVCLIENT_API char* __stdcall JVC_GetVersion( );
#endif






/****************************************************************************
*‚àöÀö‚â•‚àÜ  : JVC_ConnectRTMP
*œÄ¬∂∆í‚Äπ  : ‚àë√∑√∏√ø¬°¬®Œ©‚Äù¬°Àú‚àöŒ©√É√Ç‚àëÀõ≈í√í‚àÜÀú
*‚â§≈í¬†Àù  :	nLocalChannel		¬±√¶¬µ√ø√ï¬Æ¬µ¬ø‚à´‚âà ≈í¬Æ‚Äú¬™‚à´‚âà >=0
strURL				¬°¬®Œ©‚Äù¬µ∆í¬µ√ø√∑‚àë
rtmpConnectChange	¬°¬®Œ©‚Äù ‚àÇ≈ì√∏‚Ñ¢¬™√ø¬µÀú‚à´√ò¬†Àù
rtmpNormalData		¬†‚Äù‚àÜ¬µ‚Äú√ô‚àÜ¬µ¬†Àù√¶‚Ä∫¬™√ø¬µÀú‚à´√ò¬†Àù

  *‚àë¬µ¬™√ø√∑¬µ: true ¬µÀú‚Äù‚àö‚â•‚Ä¶œÄ¬∂ ¬µ¬ª¬•Àù¬°¬®Œ©‚Äù‚óä¬•√É¬®‚àë¬µ¬™√ø ¬™√ø¬µÀú‚à´√ò¬†Àù
*****************************************************************************/

#ifndef WIN32
JVCLIENT_API bool JVC_ConnectRTMP(int nLocalChannel,char* strURL,FUNC_CRTMP_CONNECT_CALLBACK rtmpConnectChange,FUNC_CRTMP_NORMALDATA_CALLBACK rtmpNormalData,int nTimeout);
#else
JVCLIENT_API bool __stdcall JVC_ConnectRTMP(int nLocalChannel,char* strURL,FUNC_CRTMP_CONNECT_CALLBACK rtmpConnectChange,FUNC_CRTMP_NORMALDATA_CALLBACK rtmpNormalData,int nTimeout);
#endif

/****************************************************************************
*‚àöÀö‚â•‚àÜ  : JVC_ShutdownRTMP
*œÄ¬∂∆í‚Äπ  : ‚àë√∑√∏√ø¬°¬®Œ©‚Äù¬°Àú‚àöŒ©√É√Ç‚àëÀõ≈í√í‚àÜÀú
*‚â§≈í¬†Àù  :	nLocalChannel		¬±√¶¬µ√ø√ï¬Æ¬µ¬ø‚à´‚âà ≈í¬Æ‚Äú¬™‚à´‚âà >=0

  *‚àë¬µ¬™√ø√∑¬µ: ≈íÔ¨Å
*****************************************************************************/

#ifndef WIN32
JVCLIENT_API void JVC_ShutdownRTMP(int nLocalChannel);
#else
JVCLIENT_API void __stdcall JVC_ShutdownRTMP(int nLocalChannel);
#endif


/****************************************************************************
*√ë1¬ß7√ë1¬ß7√ë1¬ß7√Å√ü√ë1¬ß7  : JVC_ClearHelpCache
*√ë1¬ß7√ë1¬ß7√ë1¬ß7√ë1¬ß7√ë1¬ß7√ë1¬ß7  : √ä‚àè√ë1¬ß7√Å¬©‚à´√ã√ë1¬ß7√ë1¬ß7√ë1¬ß7√ë1¬ß7¬©√ã√ë1¬ß7√ë1¬ß7√ë1¬ß7√ë1¬ß7‚Ä¢√Å√ë1¬ß7√ë1¬ß7√Ç‚â†√ë1¬ß7
*√ë1¬ß7√ë1¬ß7√ë1¬ß7√ë1¬ß7√ë1¬ß7√ë1¬ß7  : √ë1¬ß7√ë1¬ß7√ë1¬ß7

  *√ã√∏√ë1¬ß7√ë1¬ß7√ë1¬ß7√ë1¬ß7√ë1¬ß7√ë1¬ß7√ë1¬ß7: √ë1¬ß7√ë1¬ß7√ë1¬ß7
*****************************************************************************/

#ifndef WIN32
JVCLIENT_API void JVC_ClearHelpCache();
#else
JVCLIENT_API void __stdcall JVC_ClearHelpCache(void);
#endif

    
    /**
     * success:1
     * failed:0
     */
#ifndef WIN32
    JVCLIENT_API int JVC_SetMTU(int nMtu);
#else
    JVCLIENT_API int __stdcall  JVC_SetMTU(int nMtu);
#endif
    
/**
 * success:1
 * failed:0
*/
#ifndef WIN32
    JVCLIENT_API int JVC_StopHelp();
#else
    JVCLIENT_API int __stdcall  JVC_StopHelp();
#endif
    
/*
 ËÆæÁΩÆÊú¨Âú∞ÁöÑÊúçÂä°Âô®
*/
#ifndef WIN32
    JVCLIENT_API int JVC_SetSelfServer(char* pGroup,char* pServer);
#else
    JVCLIENT_API int __stdcall JVC_SetSelfServer(char* pGroup,char* pServer);
#endif
  
    
/*
 Âêë‰∏ªÊéßÂèëÈÄÅËÆæÁΩÆÊúçÂä°Âô®ÂëΩ‰ª§
*/
    
#ifndef WIN32
    JVCLIENT_API int JVC_SendSetServer(char* pGroup,int nYst,char* pServer,int *nLen,int nTimeOut);
#else
    JVCLIENT_API int __stdcall JVC_SendSetServer(char* pGroup,int nYst,char* pServer,int *nLen,int nTimeOut);
#endif
   
    
/*
 Âêë‰∏ªÊéßÂèëÈÄÅÂà†Èô§ÊúçÂä°Âô®ÂëΩ‰ª§
*/
    
#ifndef WIN32
    JVCLIENT_API int JVC_SendRemoveServer(char* pGroup,int nYst,char* pServer,int *nLen,int nTimeOut);
#else
    JVCLIENT_API int __stdcall JVC_SendRemoveServer(char* pGroup,int nYst,char* pServer,int *nLen,int nTimeOut);
#endif
   
    /****************************************************************************
     *名称  : JVC_StartBroadcastSelfServer
     *功能  : 开启自定义广播服务
     *参数  : [IN] nLPort      本地服务端口，<0时为默认9700
     [IN] nServerPort 设备端服务端口，<=0时为默认9108,建议统一用默认值与服务端匹配
     [IN] BCSelfData  自定义广播结果回调函数
     *返回值: TRUE/FALSE
     *其他  :
     *****************************************************************************/
#ifndef WIN32
    JVCLIENT_API bool JVC_StartBroadcastSelfServer(int nLPort, int nServerPort, FUNC_CBCSELFDATA_CALLBACK BCSelfData);
#else
    JVCLIENT_API bool __stdcall	JVC_StartBroadcastSelfServer(int nLPort, int nServerPort, FUNC_CBCSELFDATA_CALLBACK BCSelfData);
#endif
    
    /****************************************************************************
     *名称  : JVC_StopBroadcastSelfServer
     *功能  : 停止自定义广播服务
     *参数  : 无
     *返回值: 无
     *其他  : 无
     *****************************************************************************/
#ifndef WIN32
    JVCLIENT_API void JVC_StopBroadcastSelfServer();
#else
    JVCLIENT_API void __stdcall	JVC_StopBroadcastSelfServer();
#endif
    
    /****************************************************************************
     *名称  : JVC_BroadcastSelfOnce
     *功能  : 发送一次广播消息
     *参数  :
     [IN] pBuffer     广播净载数据
     [IN] nSize        广播净载数据长度
     [IN] nTimeOut  此参数目前可置为0
     *返回值: TRUE/FALSE
     *其他  :
     *****************************************************************************/
#ifndef WIN32
    JVCLIENT_API BOOL JVC_BroadcastSelfOnce(BYTE *pBuffer, int nSize, int nTimeOut);
#else
    JVCLIENT_API BOOL __stdcall JVC_BroadcastSelfOnce(BYTE *pBuffer, int nSize, int nTimeOut);
#endif
    
    /****************************************************************************
     *名称  : JVC_SendSelfDataOnceFromBC
     *功能  : 从自定义广播套接字发送一次UDP消息
     *参数  :
     [IN] pBuffer     净载数据
     [IN] nSize       净载数据长度
     [IN] pchDeviceIP 目的IP地址
     [IN] nLocalPort	  目的端口
     *返回值: 无
     *其他  :
     *****************************************************************************/
#ifndef WIN32
    JVCLIENT_API BOOL JVC_SendSelfDataOnceFromBC(BYTE *pBuffer, int nSize, char *pchDeviceIP, int nDestPort);
#else
    JVCLIENT_API BOOL __stdcall JVC_SendSelfDataOnceFromBC(BYTE *pBuffer, int nSize, char *pchDeviceIP, int nDestPort);
#endif
    
#endif
